/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const CY_EM_EEPROM_HEADER_DATA_OFFSET: u32 = 12;
pub const CY_EM_EEPROM_HEADER_CHECKSUM_OFFSET: u32 = 60;
pub const CY_EM_EEPROM_U32_DIV: u32 = 4;
pub const CY_EM_EEPROM_MAX_WEAR_LEVELING_FACTOR: u32 = 10;
pub const CY_EM_EEPROM_MAX_WRITE_DURATION_MS: u32 = 50;
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_longlong;
pub type __uint64_t = cty::c_ulonglong;
pub type __int_least8_t = cty::c_schar;
pub type __uint_least8_t = cty::c_uchar;
pub type __int_least16_t = cty::c_short;
pub type __uint_least16_t = cty::c_ushort;
pub type __int_least32_t = cty::c_int;
pub type __uint_least32_t = cty::c_uint;
pub type __int_least64_t = cty::c_longlong;
pub type __uint_least64_t = cty::c_ulonglong;
pub type __intptr_t = cty::c_int;
pub type __uintptr_t = cty::c_uint;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type uint_fast8_t = cty::c_uchar;
pub type int_fast16_t = cty::c_short;
pub type uint_fast16_t = cty::c_ushort;
pub type int_fast32_t = cty::c_int;
pub type uint_fast32_t = cty::c_uint;
pub type int_fast64_t = cty::c_longlong;
pub type uint_fast64_t = cty::c_ulonglong;
pub type intmax_t = cty::c_longlong;
pub type uintmax_t = cty::c_ulonglong;
#[doc = "   Base Types. Acceptable types from MISRA-C specifying signedness and size."]
pub type uint8 = cty::c_uchar;
pub type uint16 = cty::c_ushort;
pub type uint32 = cty::c_ulong;
pub type int8 = cty::c_schar;
pub type int16 = cty::c_short;
pub type int32 = cty::c_long;
pub type float32 = f32;
pub type float64 = f64;
pub type int64 = cty::c_longlong;
pub type uint64 = cty::c_ulonglong;
pub type char8 = cty::c_char;
unsafe extern "C" {
    pub fn CySetReg24(addr: *mut uint32, value: uint32);
}
unsafe extern "C" {
    pub fn CyGetReg24(addr: *const uint32) -> uint32;
}
pub type cystatus = cty::c_ulong;
#[doc = "  Hardware Register Types."]
pub type reg8 = uint8;
pub type reg16 = uint16;
pub type reg32 = uint32;
pub type cyisraddress = ::core::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    pub fn cyfitter_cfg();
}
unsafe extern "C" {
    pub fn SetAnalogRoutingPumps(enabled: uint8);
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BTN_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BTN_BACKUP_STRUCT"][::core::mem::size_of::<BTN_BACKUP_STRUCT>() - 12usize];
    ["Alignment of BTN_BACKUP_STRUCT"][::core::mem::align_of::<BTN_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: BTN_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(BTN_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: BTN_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(BTN_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: BTN_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(BTN_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn BTN_Read() -> uint8;
}
unsafe extern "C" {
    pub fn BTN_Write(value: uint8);
}
unsafe extern "C" {
    pub fn BTN_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn BTN_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn BTN_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn BTN_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn BTN_Sleep();
}
unsafe extern "C" {
    pub fn BTN_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LED_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LED_BACKUP_STRUCT"][::core::mem::size_of::<LED_BACKUP_STRUCT>() - 12usize];
    ["Alignment of LED_BACKUP_STRUCT"][::core::mem::align_of::<LED_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: LED_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(LED_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: LED_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(LED_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: LED_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(LED_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn LED_Read() -> uint8;
}
unsafe extern "C" {
    pub fn LED_Write(value: uint8);
}
unsafe extern "C" {
    pub fn LED_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn LED_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn LED_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn LED_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn LED_Sleep();
}
unsafe extern "C" {
    pub fn LED_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XchA_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XchA_BACKUP_STRUCT"][::core::mem::size_of::<XchA_BACKUP_STRUCT>() - 12usize];
    ["Alignment of XchA_BACKUP_STRUCT"][::core::mem::align_of::<XchA_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: XchA_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(XchA_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: XchA_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(XchA_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: XchA_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(XchA_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn XchA_Read() -> uint8;
}
unsafe extern "C" {
    pub fn XchA_Write(value: uint8);
}
unsafe extern "C" {
    pub fn XchA_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn XchA_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn XchA_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn XchA_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn XchA_Sleep();
}
unsafe extern "C" {
    pub fn XchA_Wakeup();
}
#[doc = "     Data Struct Definitions"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StepReg_BACKUP_STRUCT {
    pub controlState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StepReg_BACKUP_STRUCT"][::core::mem::size_of::<StepReg_BACKUP_STRUCT>() - 1usize];
    ["Alignment of StepReg_BACKUP_STRUCT"]
        [::core::mem::align_of::<StepReg_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: StepReg_BACKUP_STRUCT::controlState"]
        [::core::mem::offset_of!(StepReg_BACKUP_STRUCT, controlState) - 0usize];
};
unsafe extern "C" {
    #[doc = "         Function Prototypes"]
    pub fn StepReg_Write(control: uint8);
}
unsafe extern "C" {
    pub fn StepReg_Read() -> uint8;
}
unsafe extern "C" {
    pub fn StepReg_SaveConfig();
}
unsafe extern "C" {
    pub fn StepReg_RestoreConfig();
}
unsafe extern "C" {
    pub fn StepReg_Sleep();
}
unsafe extern "C" {
    pub fn StepReg_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stepX_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stepX_BACKUP_STRUCT"][::core::mem::size_of::<stepX_BACKUP_STRUCT>() - 12usize];
    ["Alignment of stepX_BACKUP_STRUCT"][::core::mem::align_of::<stepX_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: stepX_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(stepX_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: stepX_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(stepX_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: stepX_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(stepX_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn stepX_Read() -> uint8;
}
unsafe extern "C" {
    pub fn stepX_Write(value: uint8);
}
unsafe extern "C" {
    pub fn stepX_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn stepX_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn stepX_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn stepX_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn stepX_Sleep();
}
unsafe extern "C" {
    pub fn stepX_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XchB_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XchB_BACKUP_STRUCT"][::core::mem::size_of::<XchB_BACKUP_STRUCT>() - 12usize];
    ["Alignment of XchB_BACKUP_STRUCT"][::core::mem::align_of::<XchB_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: XchB_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(XchB_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: XchB_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(XchB_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: XchB_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(XchB_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn XchB_Read() -> uint8;
}
unsafe extern "C" {
    pub fn XchB_Write(value: uint8);
}
unsafe extern "C" {
    pub fn XchB_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn XchB_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn XchB_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn XchB_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn XchB_Sleep();
}
unsafe extern "C" {
    pub fn XchB_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EN_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EN_BACKUP_STRUCT"][::core::mem::size_of::<EN_BACKUP_STRUCT>() - 12usize];
    ["Alignment of EN_BACKUP_STRUCT"][::core::mem::align_of::<EN_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: EN_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(EN_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: EN_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(EN_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: EN_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(EN_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn EN_Read() -> uint8;
}
unsafe extern "C" {
    pub fn EN_Write(value: uint8);
}
unsafe extern "C" {
    pub fn EN_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn EN_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn EN_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn EN_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn EN_Sleep();
}
unsafe extern "C" {
    pub fn EN_Wakeup();
}
unsafe extern "C" {
    pub fn clkA_Start();
}
unsafe extern "C" {
    pub fn clkA_Stop();
}
unsafe extern "C" {
    pub fn clkA_SetFractionalDividerRegister(clkDivider: uint16, clkFractional: uint8);
}
unsafe extern "C" {
    pub fn clkA_GetDividerRegister() -> uint16;
}
unsafe extern "C" {
    pub fn clkA_GetFractionalDividerRegister() -> uint8;
}
unsafe extern "C" {
    pub fn ISR_Pulser_Start();
}
unsafe extern "C" {
    pub fn ISR_Pulser_StartEx(address: cyisraddress);
}
unsafe extern "C" {
    pub fn ISR_Pulser_Stop();
}
unsafe extern "C" {
    pub fn ISR_Pulser_Interrupt();
}
unsafe extern "C" {
    pub fn ISR_Pulser_SetVector(address: cyisraddress);
}
unsafe extern "C" {
    pub fn ISR_Pulser_GetVector() -> cyisraddress;
}
unsafe extern "C" {
    pub fn ISR_Pulser_SetPriority(priority: uint8);
}
unsafe extern "C" {
    pub fn ISR_Pulser_GetPriority() -> uint8;
}
unsafe extern "C" {
    pub fn ISR_Pulser_Enable();
}
unsafe extern "C" {
    pub fn ISR_Pulser_GetState() -> uint8;
}
unsafe extern "C" {
    pub fn ISR_Pulser_Disable();
}
unsafe extern "C" {
    pub fn ISR_Pulser_SetPending();
}
unsafe extern "C" {
    pub fn ISR_Pulser_ClearPending();
}
pub const cy_sys_timer_delaytype_enum_CY_SYS_TIMER_WAIT: cy_sys_timer_delaytype_enum = 0;
pub const cy_sys_timer_delaytype_enum_CY_SYS_TIMER_INTERRUPT: cy_sys_timer_delaytype_enum = 1;
pub type cy_sys_timer_delaytype_enum = cty::c_uint;
unsafe extern "C" {
    #[doc = "    Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn CySysClkIloStart();
}
unsafe extern "C" {
    pub fn CySysClkIloStop();
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_compensate\n @{"]
    pub fn CySysClkIloCompensate(desiredDelay: uint32, compensatedCycles: *mut uint32) -> cystatus;
}
unsafe extern "C" {
    pub fn CySysClkIloStartMeasurement();
}
unsafe extern "C" {
    pub fn CySysClkIloStopMeasurement();
}
pub type cyWdtCallback = ::core::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    #[doc = " \\addtogroup group_wdtsrssv2\n @{"]
    pub fn CySysWdtLock();
}
unsafe extern "C" {
    pub fn CySysWdtUnlock();
}
unsafe extern "C" {
    pub fn CySysWdtSetMode(counterNum: uint32, mode: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtGetMode(counterNum: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtGetEnabledStatus(counterNum: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtSetClearOnMatch(counterNum: uint32, enable: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtGetClearOnMatch(counterNum: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtEnable(counterMask: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtDisable(counterMask: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtSetCascade(cascadeMask: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtGetCascade() -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtSetMatch(counterNum: uint32, match_: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtSetToggleBit(bits: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtGetToggleBit() -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtGetMatch(counterNum: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtGetCount(counterNum: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtGetInterruptSource() -> uint32;
}
unsafe extern "C" {
    pub fn CySysWdtClearInterrupt(counterMask: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtResetCounters(countersMask: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtSetInterruptCallback(
        counterNum: uint32,
        function: cyWdtCallback,
    ) -> cyWdtCallback;
}
unsafe extern "C" {
    pub fn CySysWdtGetInterruptCallback(counterNum: uint32) -> cyWdtCallback;
}
unsafe extern "C" {
    pub fn CySysTimerDelay(
        counterNum: uint32,
        delayType: cy_sys_timer_delaytype_enum,
        delay: uint32,
    );
}
unsafe extern "C" {
    pub fn CySysTimerDelayUntilMatch(
        counterNum: uint32,
        delayType: cy_sys_timer_delaytype_enum,
        match_: uint32,
    );
}
unsafe extern "C" {
    pub fn CySysWatchdogFeed(counterNum: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtEnableCounterIsr(counterNum: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtDisableCounterIsr(counterNum: uint32);
}
unsafe extern "C" {
    pub fn CySysWdtIsr();
}
pub type wchar_t = cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: cty::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 16usize];
    ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 8usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 8usize];
};
pub type _LOCK_T = cty::c_int;
pub type _LOCK_RECURSIVE_T = cty::c_int;
pub type __blkcnt_t = cty::c_long;
pub type __blksize_t = cty::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = cty::c_long;
pub type __pid_t = cty::c_int;
pub type __dev_t = cty::c_short;
pub type __uid_t = cty::c_ushort;
pub type __gid_t = cty::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = cty::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = cty::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = cty::c_long;
pub type _fpos_t = cty::c_long;
pub type __size_t = cty::c_uint;
pub type _ssize_t = cty::c_int;
pub type __ssize_t = _ssize_t;
pub type wint_t = cty::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: cty::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [cty::c_uchar; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t__bindgen_ty_1"]
        [::core::mem::size_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of _mbstate_t__bindgen_ty_1"]
        [::core::mem::align_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wch"]
        [::core::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wchb"]
        [::core::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t"][::core::mem::size_of::<_mbstate_t>() - 8usize];
    ["Alignment of _mbstate_t"][::core::mem::align_of::<_mbstate_t>() - 4usize];
    ["Offset of field: _mbstate_t::__count"][::core::mem::offset_of!(_mbstate_t, __count) - 0usize];
    ["Offset of field: _mbstate_t::__value"][::core::mem::offset_of!(_mbstate_t, __value) - 4usize];
};
pub type _flock_t = _LOCK_RECURSIVE_T;
pub type _iconv_t = *mut cty::c_void;
pub type __clock_t = cty::c_ulong;
pub type __time_t = cty::c_long;
pub type __clockid_t = cty::c_ulong;
pub type __timer_t = cty::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nlink_t = cty::c_ushort;
pub type __suseconds_t = cty::c_long;
pub type __useconds_t = cty::c_ulong;
pub type __va_list = *mut cty::c_char;
pub type __ULong = cty::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: cty::c_int,
    pub _maxwds: cty::c_int,
    pub _sign: cty::c_int,
    pub _wds: cty::c_int,
    pub _x: [__ULong; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Bigint"][::core::mem::size_of::<_Bigint>() - 24usize];
    ["Alignment of _Bigint"][::core::mem::align_of::<_Bigint>() - 4usize];
    ["Offset of field: _Bigint::_next"][::core::mem::offset_of!(_Bigint, _next) - 0usize];
    ["Offset of field: _Bigint::_k"][::core::mem::offset_of!(_Bigint, _k) - 4usize];
    ["Offset of field: _Bigint::_maxwds"][::core::mem::offset_of!(_Bigint, _maxwds) - 8usize];
    ["Offset of field: _Bigint::_sign"][::core::mem::offset_of!(_Bigint, _sign) - 12usize];
    ["Offset of field: _Bigint::_wds"][::core::mem::offset_of!(_Bigint, _wds) - 16usize];
    ["Offset of field: _Bigint::_x"][::core::mem::offset_of!(_Bigint, _x) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: cty::c_int,
    pub __tm_min: cty::c_int,
    pub __tm_hour: cty::c_int,
    pub __tm_mday: cty::c_int,
    pub __tm_mon: cty::c_int,
    pub __tm_year: cty::c_int,
    pub __tm_wday: cty::c_int,
    pub __tm_yday: cty::c_int,
    pub __tm_isdst: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __tm"][::core::mem::size_of::<__tm>() - 36usize];
    ["Alignment of __tm"][::core::mem::align_of::<__tm>() - 4usize];
    ["Offset of field: __tm::__tm_sec"][::core::mem::offset_of!(__tm, __tm_sec) - 0usize];
    ["Offset of field: __tm::__tm_min"][::core::mem::offset_of!(__tm, __tm_min) - 4usize];
    ["Offset of field: __tm::__tm_hour"][::core::mem::offset_of!(__tm, __tm_hour) - 8usize];
    ["Offset of field: __tm::__tm_mday"][::core::mem::offset_of!(__tm, __tm_mday) - 12usize];
    ["Offset of field: __tm::__tm_mon"][::core::mem::offset_of!(__tm, __tm_mon) - 16usize];
    ["Offset of field: __tm::__tm_year"][::core::mem::offset_of!(__tm, __tm_year) - 20usize];
    ["Offset of field: __tm::__tm_wday"][::core::mem::offset_of!(__tm, __tm_wday) - 24usize];
    ["Offset of field: __tm::__tm_yday"][::core::mem::offset_of!(__tm, __tm_yday) - 28usize];
    ["Offset of field: __tm::__tm_isdst"][::core::mem::offset_of!(__tm, __tm_isdst) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut cty::c_void; 32usize],
    pub _dso_handle: [*mut cty::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _on_exit_args"][::core::mem::size_of::<_on_exit_args>() - 264usize];
    ["Alignment of _on_exit_args"][::core::mem::align_of::<_on_exit_args>() - 4usize];
    ["Offset of field: _on_exit_args::_fnargs"]
        [::core::mem::offset_of!(_on_exit_args, _fnargs) - 0usize];
    ["Offset of field: _on_exit_args::_dso_handle"]
        [::core::mem::offset_of!(_on_exit_args, _dso_handle) - 128usize];
    ["Offset of field: _on_exit_args::_fntypes"]
        [::core::mem::offset_of!(_on_exit_args, _fntypes) - 256usize];
    ["Offset of field: _on_exit_args::_is_cxa"]
        [::core::mem::offset_of!(_on_exit_args, _is_cxa) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: cty::c_int,
    pub _fns: [::core::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args: _on_exit_args,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _atexit"][::core::mem::size_of::<_atexit>() - 400usize];
    ["Alignment of _atexit"][::core::mem::align_of::<_atexit>() - 4usize];
    ["Offset of field: _atexit::_next"][::core::mem::offset_of!(_atexit, _next) - 0usize];
    ["Offset of field: _atexit::_ind"][::core::mem::offset_of!(_atexit, _ind) - 4usize];
    ["Offset of field: _atexit::_fns"][::core::mem::offset_of!(_atexit, _fns) - 8usize];
    ["Offset of field: _atexit::_on_exit_args"]
        [::core::mem::offset_of!(_atexit, _on_exit_args) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut cty::c_uchar,
    pub _size: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 8usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 4usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut cty::c_uchar,
    pub _r: cty::c_int,
    pub _w: cty::c_int,
    pub _flags: cty::c_short,
    pub _file: cty::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: cty::c_int,
    pub _cookie: *mut cty::c_void,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut cty::c_void,
            arg3: *mut cty::c_char,
            arg4: cty::c_int,
        ) -> cty::c_int,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut cty::c_void,
            arg3: *const cty::c_char,
            arg4: cty::c_int,
        ) -> cty::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut cty::c_void,
            arg3: _fpos_t,
            arg4: cty::c_int,
        ) -> _fpos_t,
    >,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut cty::c_void) -> cty::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut cty::c_uchar,
    pub _ur: cty::c_int,
    pub _ubuf: [cty::c_uchar; 3usize],
    pub _nbuf: [cty::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: cty::c_int,
    pub _offset: _off_t,
    pub _data: *mut _reent,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 104usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 4usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 4usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 8usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 12usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 14usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 16usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 24usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 28usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 32usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 36usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 40usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 44usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 48usize];
    ["Offset of field: __sFILE::_up"][::core::mem::offset_of!(__sFILE, _up) - 56usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 60usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 64usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 67usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 68usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 76usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 80usize];
    ["Offset of field: __sFILE::_data"][::core::mem::offset_of!(__sFILE, _data) - 84usize];
    ["Offset of field: __sFILE::_lock"][::core::mem::offset_of!(__sFILE, _lock) - 88usize];
    ["Offset of field: __sFILE::_mbstate"][::core::mem::offset_of!(__sFILE, _mbstate) - 92usize];
    ["Offset of field: __sFILE::_flags2"][::core::mem::offset_of!(__sFILE, _flags2) - 100usize];
};
pub type __FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: cty::c_int,
    pub _iobs: *mut __FILE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _glue"][::core::mem::size_of::<_glue>() - 12usize];
    ["Alignment of _glue"][::core::mem::align_of::<_glue>() - 4usize];
    ["Offset of field: _glue::_next"][::core::mem::offset_of!(_glue, _next) - 0usize];
    ["Offset of field: _glue::_niobs"][::core::mem::offset_of!(_glue, _niobs) - 4usize];
    ["Offset of field: _glue::_iobs"][::core::mem::offset_of!(_glue, _iobs) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [cty::c_ushort; 3usize],
    pub _mult: [cty::c_ushort; 3usize],
    pub _add: cty::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _rand48"][::core::mem::size_of::<_rand48>() - 14usize];
    ["Alignment of _rand48"][::core::mem::align_of::<_rand48>() - 2usize];
    ["Offset of field: _rand48::_seed"][::core::mem::offset_of!(_rand48, _seed) - 0usize];
    ["Offset of field: _rand48::_mult"][::core::mem::offset_of!(_rand48, _mult) - 6usize];
    ["Offset of field: _rand48::_add"][::core::mem::offset_of!(_rand48, _add) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent {
    pub _errno: cty::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: cty::c_int,
    pub _emergency: [cty::c_char; 25usize],
    pub _current_category: cty::c_int,
    pub _current_locale: *const cty::c_char,
    pub __sdidinit: cty::c_int,
    pub __cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _result: *mut _Bigint,
    pub _result_k: cty::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
    pub _cvtlen: cty::c_int,
    pub _cvtbuf: *mut cty::c_char,
    pub _new: _reent__bindgen_ty_1,
    pub _atexit: *mut _atexit,
    pub _atexit0: _atexit,
    pub _sig_func: *mut ::core::option::Option<unsafe extern "C" fn(arg1: cty::c_int)>,
    pub __sglue: _glue,
    pub __sf: [__FILE; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _reent: _reent__bindgen_ty_1__bindgen_ty_1,
    pub _unused: _reent__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _unused_rand: cty::c_uint,
    pub _strtok_last: *mut cty::c_char,
    pub _asctime_buf: [cty::c_char; 26usize],
    pub _localtime_buf: __tm,
    pub _gamma_signgam: cty::c_int,
    pub _rand_next: cty::c_ulonglong,
    pub _r48: _rand48,
    pub _mblen_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _l64a_buf: [cty::c_char; 8usize],
    pub _signal_buf: [cty::c_char; 24usize],
    pub _getdate_err: cty::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
    pub _h_errno: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 208usize];
    ["Alignment of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_unused_rand"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _unused_rand) - 0usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_strtok_last"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _strtok_last) - 4usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_asctime_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _asctime_buf) - 8usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_localtime_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _localtime_buf) - 36usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_gamma_signgam"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _gamma_signgam) - 72usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_rand_next"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _rand_next) - 80usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_r48"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _r48) - 88usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mblen_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mblen_state) - 104usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbtowc_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbtowc_state) - 112usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wctomb_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wctomb_state) - 120usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_l64a_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _l64a_buf) - 128usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_signal_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _signal_buf) - 136usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_getdate_err"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _getdate_err) - 160usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbrlen_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbrlen_state) - 164usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbrtowc_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbrtowc_state) - 172usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbsrtowcs_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbsrtowcs_state) - 180usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wcrtomb_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wcrtomb_state) - 188usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wcsrtombs_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wcsrtombs_state) - 196usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_h_errno"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _h_errno) - 204usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_2 {
    pub _nextf: [*mut cty::c_uchar; 30usize],
    pub _nmalloc: [cty::c_uint; 30usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_2>() - 240usize];
    ["Alignment of _reent__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_2::_nextf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_2, _nextf) - 0usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_2::_nmalloc"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_2, _nmalloc) - 120usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1"][::core::mem::size_of::<_reent__bindgen_ty_1>() - 240usize];
    ["Alignment of _reent__bindgen_ty_1"][::core::mem::align_of::<_reent__bindgen_ty_1>() - 8usize];
    ["Offset of field: _reent__bindgen_ty_1::_reent"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1, _reent) - 0usize];
    ["Offset of field: _reent__bindgen_ty_1::_unused"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1, _unused) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent"][::core::mem::size_of::<_reent>() - 1064usize];
    ["Alignment of _reent"][::core::mem::align_of::<_reent>() - 8usize];
    ["Offset of field: _reent::_errno"][::core::mem::offset_of!(_reent, _errno) - 0usize];
    ["Offset of field: _reent::_stdin"][::core::mem::offset_of!(_reent, _stdin) - 4usize];
    ["Offset of field: _reent::_stdout"][::core::mem::offset_of!(_reent, _stdout) - 8usize];
    ["Offset of field: _reent::_stderr"][::core::mem::offset_of!(_reent, _stderr) - 12usize];
    ["Offset of field: _reent::_inc"][::core::mem::offset_of!(_reent, _inc) - 16usize];
    ["Offset of field: _reent::_emergency"][::core::mem::offset_of!(_reent, _emergency) - 20usize];
    ["Offset of field: _reent::_current_category"]
        [::core::mem::offset_of!(_reent, _current_category) - 48usize];
    ["Offset of field: _reent::_current_locale"]
        [::core::mem::offset_of!(_reent, _current_locale) - 52usize];
    ["Offset of field: _reent::__sdidinit"][::core::mem::offset_of!(_reent, __sdidinit) - 56usize];
    ["Offset of field: _reent::__cleanup"][::core::mem::offset_of!(_reent, __cleanup) - 60usize];
    ["Offset of field: _reent::_result"][::core::mem::offset_of!(_reent, _result) - 64usize];
    ["Offset of field: _reent::_result_k"][::core::mem::offset_of!(_reent, _result_k) - 68usize];
    ["Offset of field: _reent::_p5s"][::core::mem::offset_of!(_reent, _p5s) - 72usize];
    ["Offset of field: _reent::_freelist"][::core::mem::offset_of!(_reent, _freelist) - 76usize];
    ["Offset of field: _reent::_cvtlen"][::core::mem::offset_of!(_reent, _cvtlen) - 80usize];
    ["Offset of field: _reent::_cvtbuf"][::core::mem::offset_of!(_reent, _cvtbuf) - 84usize];
    ["Offset of field: _reent::_new"][::core::mem::offset_of!(_reent, _new) - 88usize];
    ["Offset of field: _reent::_atexit"][::core::mem::offset_of!(_reent, _atexit) - 328usize];
    ["Offset of field: _reent::_atexit0"][::core::mem::offset_of!(_reent, _atexit0) - 332usize];
    ["Offset of field: _reent::_sig_func"][::core::mem::offset_of!(_reent, _sig_func) - 732usize];
    ["Offset of field: _reent::__sglue"][::core::mem::offset_of!(_reent, __sglue) - 736usize];
    ["Offset of field: _reent::__sf"][::core::mem::offset_of!(_reent, __sf) - 748usize];
};
unsafe extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
unsafe extern "C" {
    pub static _global_impure_ptr: *mut _reent;
}
unsafe extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
unsafe extern "C" {
    pub fn memchr(
        arg1: *const cty::c_void,
        arg2: cty::c_int,
        arg3: cty::c_uint,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        arg1: *const cty::c_void,
        arg2: *const cty::c_void,
        arg3: cty::c_uint,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: cty::c_uint,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: cty::c_uint,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn memset(arg1: *mut cty::c_void, arg2: cty::c_int, arg3: cty::c_uint) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn strcat(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strchr(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strcmp(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strcoll(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strcpy(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strcspn(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_uint;
}
unsafe extern "C" {
    pub fn strerror(arg1: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strlen(arg1: *const cty::c_char) -> cty::c_uint;
}
unsafe extern "C" {
    pub fn strncat(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(arg1: *const cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strrchr(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strspn(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_uint;
}
unsafe extern "C" {
    pub fn strstr(arg1: *const cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strtok(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> cty::c_uint;
}
unsafe extern "C" {
    pub fn strtok_r(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: *mut *mut cty::c_char,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        arg1: *const cty::c_void,
        arg2: *const cty::c_void,
        arg3: cty::c_uint,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn bcopy(arg1: *const cty::c_void, arg2: *mut cty::c_void, arg3: cty::c_uint);
}
unsafe extern "C" {
    pub fn bzero(arg1: *mut cty::c_void, arg2: cty::c_uint);
}
unsafe extern "C" {
    pub fn explicit_bzero(arg1: *mut cty::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn timingsafe_bcmp(
        arg1: *const cty::c_void,
        arg2: *const cty::c_void,
        arg3: usize,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn timingsafe_memcmp(
        arg1: *const cty::c_void,
        arg2: *const cty::c_void,
        arg3: usize,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn ffs(arg1: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn index(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn memccpy(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: cty::c_int,
        arg4: cty::c_uint,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn rindex(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strcasecmp(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strdup(arg1: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn _strdup_r(arg1: *mut _reent, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strndup(arg1: *const cty::c_char, arg2: cty::c_uint) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn _strndup_r(arg1: *mut _reent, arg2: *const cty::c_char, arg3: usize)
        -> *mut cty::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(arg1: cty::c_int, arg2: *mut cty::c_char, arg3: usize) -> cty::c_int;
}
unsafe extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: cty::c_int,
        arg3: cty::c_int,
        arg4: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strlcat(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> cty::c_uint;
}
unsafe extern "C" {
    pub fn strlcpy(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> cty::c_uint;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: cty::c_uint,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strnlen(arg1: *const cty::c_char, arg2: usize) -> usize;
}
unsafe extern "C" {
    pub fn strsep(arg1: *mut *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strlwr(arg1: *mut cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strupr(arg1: *mut cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__signo: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn isalnum(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isalpha(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn iscntrl(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isdigit(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isgraph(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn islower(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isprint(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn ispunct(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isspace(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isupper(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isxdigit(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn tolower(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn toupper(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isblank(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn isascii(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn toascii(__c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub static mut __ctype_ptr__: *const cty::c_char;
}
unsafe extern "C" {
    pub static _ctype_: [cty::c_char; 0usize];
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_clocking_hfclk High-Frequency Clocking API\n \\ingroup group_clocking\n @{"]
    pub fn CySysClkImoStart();
}
unsafe extern "C" {
    pub fn CySysClkImoStop();
}
unsafe extern "C" {
    pub fn CySysClkWriteHfclkDirect(clkSelect: uint32);
}
unsafe extern "C" {
    pub fn CySysClkWriteSysclkDiv(divider: uint32);
}
unsafe extern "C" {
    pub fn CySysClkWriteImoFreq(freq: uint32);
}
unsafe extern "C" {
    pub fn CySysClkGetSysclkSource() -> uint32;
}
unsafe extern "C" {
    pub fn CySysEnablePumpClock(enable: uint32);
}
unsafe extern "C" {
    pub fn CySysLvdEnable(threshold: uint32);
}
unsafe extern "C" {
    pub fn CySysLvdDisable();
}
unsafe extern "C" {
    pub fn CySysLvdGetInterruptSource() -> uint32;
}
unsafe extern "C" {
    pub fn CySysLvdClearInterrupt();
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_interrupts Interrupt API\n \\brief The APIs in this chapter apply to all architectures except as noted. The Interrupts API is provided in the\n CyLib.c and CyLib.h files. Refer also to the Interrupt component datasheet for more information about interrupts.\n @{"]
    pub fn CyIntSetSysVector(number: uint8, address: cyisraddress) -> cyisraddress;
}
unsafe extern "C" {
    pub fn CyIntGetSysVector(number: uint8) -> cyisraddress;
}
unsafe extern "C" {
    pub fn CyIntSetVector(number: uint8, address: cyisraddress) -> cyisraddress;
}
unsafe extern "C" {
    pub fn CyIntGetVector(number: uint8) -> cyisraddress;
}
unsafe extern "C" {
    pub fn CyIntSetPriority(number: uint8, priority: uint8);
}
unsafe extern "C" {
    pub fn CyIntGetPriority(number: uint8) -> uint8;
}
unsafe extern "C" {
    pub fn CyIntEnable(number: uint8);
}
unsafe extern "C" {
    pub fn CyIntGetState(number: uint8) -> uint8;
}
unsafe extern "C" {
    pub fn CyIntDisable(number: uint8);
}
unsafe extern "C" {
    pub fn CyIntSetPending(number: uint8);
}
unsafe extern "C" {
    pub fn CyIntClearPending(number: uint8);
}
unsafe extern "C" {
    pub fn CyDisableInts() -> uint32;
}
unsafe extern "C" {
    pub fn CyEnableInts(mask: uint32);
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_api_delay_functions Delay API\n @{"]
    pub static mut cydelayFreqHz: uint32;
}
unsafe extern "C" {
    pub static mut cydelayFreqKhz: uint32;
}
unsafe extern "C" {
    pub static mut cydelayFreqMhz: uint8;
}
unsafe extern "C" {
    pub static mut cydelay32kMs: uint32;
}
unsafe extern "C" {
    pub fn CyDelay(milliseconds: uint32);
}
unsafe extern "C" {
    pub fn CyDelayUs(microseconds: uint16);
}
unsafe extern "C" {
    pub fn CyDelayFreq(freq: uint32);
}
unsafe extern "C" {
    pub fn CyDelayCycles(cycles: uint32);
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_api_system_functions System API\n @{"]
    pub fn CySoftwareReset();
}
unsafe extern "C" {
    pub fn CyEnterCriticalSection() -> uint8;
}
unsafe extern "C" {
    pub fn CyExitCriticalSection(savedIntrStatus: uint8);
}
unsafe extern "C" {
    pub fn CyHalt(reason: uint8);
}
unsafe extern "C" {
    pub fn CySysGetResetReason(reason: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn CyGetUniqueId(uniqueId: *mut uint32);
}
unsafe extern "C" {
    pub fn IntDefaultHandler();
}
#[doc = " \\addtogroup group_api_systick_functions System Timer (SysTick) API\n @{"]
pub type cySysTickCallback = ::core::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    pub fn CySysTickStart();
}
unsafe extern "C" {
    pub fn CySysTickInit();
}
unsafe extern "C" {
    pub fn CySysTickEnable();
}
unsafe extern "C" {
    pub fn CySysTickStop();
}
unsafe extern "C" {
    pub fn CySysTickEnableInterrupt();
}
unsafe extern "C" {
    pub fn CySysTickDisableInterrupt();
}
unsafe extern "C" {
    pub fn CySysTickSetReload(value: uint32);
}
unsafe extern "C" {
    pub fn CySysTickGetReload() -> uint32;
}
unsafe extern "C" {
    pub fn CySysTickGetValue() -> uint32;
}
unsafe extern "C" {
    pub fn CySysTickSetCallback(number: uint32, function: cySysTickCallback) -> cySysTickCallback;
}
unsafe extern "C" {
    pub fn CySysTickGetCallback(number: uint32) -> cySysTickCallback;
}
unsafe extern "C" {
    pub fn CySysTickGetCountFlag() -> uint32;
}
unsafe extern "C" {
    pub fn CySysTickClear();
}
unsafe extern "C" {
    pub static mut CySysTickInitVar: uint32;
}
unsafe extern "C" {
    pub static cyImoFreqMhz2Reg: [uint8; 46usize];
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UART_tx_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UART_tx_BACKUP_STRUCT"][::core::mem::size_of::<UART_tx_BACKUP_STRUCT>() - 12usize];
    ["Alignment of UART_tx_BACKUP_STRUCT"]
        [::core::mem::align_of::<UART_tx_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: UART_tx_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(UART_tx_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: UART_tx_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(UART_tx_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: UART_tx_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(UART_tx_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn UART_tx_Read() -> uint8;
}
unsafe extern "C" {
    pub fn UART_tx_Write(value: uint8);
}
unsafe extern "C" {
    pub fn UART_tx_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn UART_tx_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn UART_tx_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn UART_tx_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn UART_tx_Sleep();
}
unsafe extern "C" {
    pub fn UART_tx_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UART_rx_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UART_rx_BACKUP_STRUCT"][::core::mem::size_of::<UART_rx_BACKUP_STRUCT>() - 12usize];
    ["Alignment of UART_rx_BACKUP_STRUCT"]
        [::core::mem::align_of::<UART_rx_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: UART_rx_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(UART_rx_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: UART_rx_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(UART_rx_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: UART_rx_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(UART_rx_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn UART_rx_Read() -> uint8;
}
unsafe extern "C" {
    pub fn UART_rx_Write(value: uint8);
}
unsafe extern "C" {
    pub fn UART_rx_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn UART_rx_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn UART_rx_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn UART_rx_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn UART_rx_Sleep();
}
unsafe extern "C" {
    pub fn UART_rx_Wakeup();
}
unsafe extern "C" {
    pub fn UART_SCBCLK_Start();
}
unsafe extern "C" {
    pub fn UART_SCBCLK_Stop();
}
unsafe extern "C" {
    pub fn UART_SCBCLK_SetFractionalDividerRegister(clkDivider: uint16, clkFractional: uint8);
}
unsafe extern "C" {
    pub fn UART_SCBCLK_GetDividerRegister() -> uint16;
}
unsafe extern "C" {
    pub fn UART_SCBCLK_GetFractionalDividerRegister() -> uint8;
}
#[doc = "       Type Definitions"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UART_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UART_BACKUP_STRUCT"][::core::mem::size_of::<UART_BACKUP_STRUCT>() - 1usize];
    ["Alignment of UART_BACKUP_STRUCT"][::core::mem::align_of::<UART_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: UART_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(UART_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    #[doc = " \\addtogroup group_general\n @{"]
    pub fn UART_Init();
}
unsafe extern "C" {
    pub fn UART_Enable();
}
unsafe extern "C" {
    pub fn UART_Start();
}
unsafe extern "C" {
    pub fn UART_Stop();
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn UART_Sleep();
}
unsafe extern "C" {
    pub fn UART_Wakeup();
}
unsafe extern "C" {
    pub fn UART_SetCustomInterruptHandler(func: ::core::option::Option<unsafe extern "C" fn()>);
}
unsafe extern "C" {
    pub fn UART_SetRxFifoLevel(level: uint32);
}
unsafe extern "C" {
    pub fn UART_SetTxFifoLevel(level: uint32);
}
unsafe extern "C" {
    #[doc = " UART_initVar indicates whether the UART\n  component has been initialized. The variable is initialized to 0\n  and set to 1 the first time SCB_Start() is called. This allows\n  the component to restart without reinitialization after the first\n  call to the UART_Start() routine.\n\n  If re-initialization of the component is required, then the\n  UART_Init() function can be called before the\n  UART_Start() or UART_Enable() function."]
    pub static mut UART_initVar: uint8;
}
unsafe extern "C" {
    pub fn UART_I2CSlaveNackGeneration();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UART_SPI_INIT_STRUCT {
    #[doc = " Mode of operation for SPI. The following defines are available choices:\n  - UART_SPI_SLAVE\n  - UART_SPI_MASTE"]
    pub mode: uint32,
    #[doc = " Submode of operation for SPI. The following defines are available\n  choices:\n  - UART_SPI_MODE_MOTOROLA\n  - UART_SPI_MODE_TI_COINCIDES\n  - UART_SPI_MODE_TI_PRECEDES\n  - UART_SPI_MODE_NATIONAL"]
    pub submode: uint32,
    #[doc = " Determines the sclk relationship for Motorola submode. Ignored\n  for other submodes. The following defines are available choices:\n  - UART_SPI_SCLK_CPHA0_CPOL0\n  - UART_SPI_SCLK_CPHA0_CPOL1\n  - UART_SPI_SCLK_CPHA1_CPOL0\n  - UART_SPI_SCLK_CPHA1_CPOL1"]
    pub sclkMode: uint32,
    #[doc = " Oversampling factor for the SPI clock. Ignored for Slave mode operation."]
    pub oversample: uint32,
    #[doc = " Applies median filter on the input lines: 0  not applied, 1  applied."]
    pub enableMedianFilter: uint32,
    #[doc = " Applies late sampling of MISO line: 0  not applied, 1  applied.\n  Ignored for slave mode."]
    pub enableLateSampling: uint32,
    #[doc = " Enables wakeup from low power mode: 0  disable, 1  enable.\n  Ignored for master mode."]
    pub enableWake: uint32,
    #[doc = " Number of data bits for RX direction.\n  Different dataBitsRx and dataBitsTx are only allowed for National\n  submode."]
    pub rxDataBits: uint32,
    #[doc = " Number of data bits for TX direction.\n  Different dataBitsRx and dataBitsTx are only allowed for National\n  submode."]
    pub txDataBits: uint32,
    #[doc = " Determines the bit ordering. The following defines are available\n  choices:\n  - UART_BITS_ORDER_LSB_FIRST\n  - UART_BITS_ORDER_MSB_FIRST"]
    pub bitOrder: uint32,
    #[doc = " Determines whether transfers are back to back or have SS disabled\n  between words. Ignored for slave mode. The following defines are\n  available choices:\n  - UART_SPI_TRANSFER_CONTINUOUS\n  - UART_SPI_TRANSFER_SEPARATED"]
    pub transferSeperation: uint32,
    #[doc = " Size of the RX buffer in bytes/words (depends on rxDataBits parameter).\n  A value equal to the RX FIFO depth implies the usage of buffering in\n  hardware. A value greater than the RX FIFO depth results in a software\n  buffer.\n  The UART_INTR _RX_NOT_EMPTY interrupt has to be enabled to\n  transfer data into the software buffer.\n  - The RX and TX FIFO depth is equal to 8 bytes/words for PSoC 4100 /\n    PSoC 4200 devices.\n  - The RX and TX FIFO depth is equal to 8 bytes/words or 16\n    bytes (Byte mode is enabled) for PSoC 4100 BLE / PSoC 4200 BLE /\n    PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n    PSoC Analog Coprocessor devices."]
    pub rxBufferSize: uint32,
    #[doc = " Buffer space provided for a RX software buffer:\n  - A NULL pointer must be provided to use hardware buffering.\n  - A pointer to an allocated buffer must be provided to use software\n    buffering. The buffer size must equal (rxBufferSize + 1) in bytes if\n    dataBitsRx is less or equal to 8, otherwise (2 * (rxBufferSize + 1))\n    in bytes. The software RX buffer always keeps one element empty.\n    For correct operation the allocated RX buffer has to be one element\n    greater than maximum packet size expected to be received."]
    pub rxBuffer: *mut uint8,
    #[doc = " Size of the TX buffer in bytes/words(depends on txDataBits parameter).\n  A value equal to the TX FIFO depth implies the usage of buffering in\n  hardware. A value greater than the TX FIFO depth results in a software\n  buffer.\n  - The RX and TX FIFO depth is equal to 8 bytes/words for PSoC 4100 /\n    PSoC 4200 devices.\n  - The RX and TX FIFO depth is equal to 8 bytes/words or 16\n    bytes (Byte mode is enabled) for PSoC 4100 BLE / PSoC 4200 BLE /\n    PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n    PSoC Analog Coprocessor devices."]
    pub txBufferSize: uint32,
    #[doc = " Buffer space provided for a TX software buffer:\n  - A NULL pointer must be provided to use hardware buffering.\n  - A pointer to an allocated buffer must be provided to use software\n    buffering. The buffer size must equal txBufferSize if dataBitsTx is\n    less or equal to 8, otherwise (2* txBufferSize)."]
    pub txBuffer: *mut uint8,
    #[doc = " Enables component interrupt: 0  disable, 1  enable.\n  The interrupt has to be enabled if software buffer is used."]
    pub enableInterrupt: uint32,
    #[doc = " Mask of enabled interrupt sources for the RX direction. This mask is\n  written regardless of the setting of the enable Interrupt field.\n  Multiple sources are enabled by providing a value that is the OR of\n  all of the following sources to enable:\n  - UART_INTR_RX_FIFO_LEVEL\n  - UART_INTR_RX_NOT_EMPTY\n  - UART_INTR_RX_FULL\n  - UART_INTR_RX_OVERFLOW\n  - UART_INTR_RX_UNDERFLOW\n  - UART_INTR_SLAVE_SPI_BUS_ERROR"]
    pub rxInterruptMask: uint32,
    #[doc = " FIFO level for an RX FIFO level interrupt. This value is written\n  regardless of whether the RX FIFO level interrupt source is enabled."]
    pub rxTriggerLevel: uint32,
    #[doc = " Mask of enabled interrupt sources for the TX direction. This mask is\n  written regardless of the setting of the enable Interrupt field.\n  Multiple sources are enabled by providing a value that is the OR of\n  all of the following sources to enable:\n  - UART_INTR_TX_FIFO_LEVEL\n  - UART_INTR_TX_NOT_FULL\n  - UART_INTR_TX_EMPTY\n  - UART_INTR_TX_OVERFLOW\n  - UART_INTR_TX_UNDERFLOW\n  - UART_INTR_MASTER_SPI_DONE"]
    pub txInterruptMask: uint32,
    #[doc = " FIFO level for a TX FIFO level interrupt. This value is written\n regardless of whether the TX FIFO level interrupt source is enabled."]
    pub txTriggerLevel: uint32,
    #[doc = " When enabled the TX and RX FIFO depth is doubled and equal to\n  16 bytes: 0  disable, 1  enable. This implies that number of\n  TX and RX data bits must be less than or equal to 8.\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub enableByteMode: uint8,
    #[doc = " Enables continuous SCLK generation by the SPI master: 0  disable,\n  1  enable.\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub enableFreeRunSclk: uint8,
    #[doc = " Active polarity of slave select lines 0-3. This is bit mask where bit\n  UART_SPI_SLAVE_SELECT0 corresponds to slave select 0\n  polarity, bit UART_SPI_SLAVE_SELECT1  slave select 1\n  polarity and so on. Polarity constants are:\n  - UART_SPI_SS_ACTIVE_LOW\n  - UART_SPI_SS_ACTIVE_HIGH\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub polaritySs: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UART_SPI_INIT_STRUCT"][::core::mem::size_of::<UART_SPI_INIT_STRUCT>() - 84usize];
    ["Alignment of UART_SPI_INIT_STRUCT"][::core::mem::align_of::<UART_SPI_INIT_STRUCT>() - 4usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::mode"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, mode) - 0usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::submode"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, submode) - 4usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::sclkMode"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, sclkMode) - 8usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::oversample"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, oversample) - 12usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::enableMedianFilter"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, enableMedianFilter) - 16usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::enableLateSampling"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, enableLateSampling) - 20usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::enableWake"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, enableWake) - 24usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::rxDataBits"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, rxDataBits) - 28usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::txDataBits"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, txDataBits) - 32usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::bitOrder"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, bitOrder) - 36usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::transferSeperation"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, transferSeperation) - 40usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::rxBufferSize"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, rxBufferSize) - 44usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::rxBuffer"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, rxBuffer) - 48usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::txBufferSize"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, txBufferSize) - 52usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::txBuffer"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, txBuffer) - 56usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::enableInterrupt"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, enableInterrupt) - 60usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::rxInterruptMask"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, rxInterruptMask) - 64usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::rxTriggerLevel"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, rxTriggerLevel) - 68usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::txInterruptMask"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, txInterruptMask) - 72usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::txTriggerLevel"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, txTriggerLevel) - 76usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::enableByteMode"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, enableByteMode) - 80usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::enableFreeRunSclk"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, enableFreeRunSclk) - 81usize];
    ["Offset of field: UART_SPI_INIT_STRUCT::polaritySs"]
        [::core::mem::offset_of!(UART_SPI_INIT_STRUCT, polaritySs) - 82usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UART_UART_INIT_STRUCT {
    #[doc = " Mode of operation for the UART. The following defines are available\n  choices:\n  - UART_UART_MODE_STD\n  - UART_UART_MODE_SMARTCARD\n  - UART_UART_MODE_IRDA"]
    pub mode: uint32,
    #[doc = " Direction of operation for the UART. The following defines are available\n  choices:\n  - UART_UART_TX_RX\n  - UART_UART_RX\n  - UART_UART_TX"]
    pub direction: uint32,
    #[doc = " Number of data bits."]
    pub dataBits: uint32,
    #[doc = " Determines the parity. The following defines are available choices:\n  - UART_UART_PARITY_EVEN\n  - UART_UART_PARITY_ODD\n  - UART_UART_PARITY_NONE"]
    pub parity: uint32,
    #[doc = " Determines the number of stop bits. The following defines are available\n  choices:\n  - UART_UART_STOP_BITS_1\n  - UART_UART_STOP_BITS_1_5\n  - UART_UART_STOP_BITS_2"]
    pub stopBits: uint32,
    #[doc = " Oversampling factor for the UART.\n\n  Note The oversampling factor values are changed when enableIrdaLowPower\n  is enabled:\n  - UART_UART_IRDA_LP_OVS16\n  - UART_UART_IRDA_LP_OVS32\n  - UART_UART_IRDA_LP_OVS48\n  - UART_UART_IRDA_LP_OVS96\n  - UART_UART_IRDA_LP_OVS192\n  - UART_UART_IRDA_LP_OVS768\n  - UART_UART_IRDA_LP_OVS1536"]
    pub oversample: uint32,
    #[doc = " Enables IrDA low power RX mode operation: 0  disable, 1  enable.\n  The TX functionality does not work when enabled."]
    pub enableIrdaLowPower: uint32,
    #[doc = " Applies median filter on the input lines:  0  not applied, 1  applied."]
    pub enableMedianFilter: uint32,
    #[doc = " Enables retry when NACK response was received: 0  disable, 1  enable.\n  Only current content of TX FIFO is re-sent.\n  Ignored for modes other than SmartCard."]
    pub enableRetryNack: uint32,
    #[doc = " Inverts polarity of RX line: 0  non-inverting, 1  inverting.\n  Ignored for modes other than IrDA."]
    pub enableInvertedRx: uint32,
    #[doc = " Drop data from RX FIFO if parity error is detected: 0  disable,\n  1  enable."]
    pub dropOnParityErr: uint32,
    #[doc = " Drop data from RX FIFO if a frame error is detected: 0  disable,\n  1  enable."]
    pub dropOnFrameErr: uint32,
    #[doc = " Enables wakeup from low power mode: 0  disable, 1  enable.\n  Ignored for modes other than standard UART. The RX functionality\n  has to be enabled."]
    pub enableWake: uint32,
    #[doc = " Size of the RX buffer in bytes/words (depends on rxDataBits parameter).\n  A value equal to the RX FIFO depth implies the usage of buffering in\n  hardware. A value greater than the RX FIFO depth results in a software\n  buffer.\n  The UART_INTR _RX_NOT_EMPTY interrupt has to be enabled to\n  transfer data into the software buffer.\n  - The RX and TX FIFO depth is equal to 8 bytes/words for PSoC 4100 /\n    PSoC 4200 devices.\n  - The RX and TX FIFO depth is equal to 8 bytes/words or 16\n    bytes (Byte mode is enabled) for PSoC 4100 BLE / PSoC 4200 BLE /\n    PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n    PSoC Analog Coprocessor devices."]
    pub rxBufferSize: uint32,
    #[doc = " Buffer space provided for a RX software buffer:\n  - A NULL pointer must be provided to use hardware buffering.\n  - A pointer to an allocated buffer must be provided to use software\n    buffering. The buffer size must equal (rxBufferSize + 1) in bytes if\n    dataBitsRx is less or equal to 8, otherwise (2 * (rxBufferSize + 1))\n    in bytes. The software RX buffer always keeps one element empty.\n    For correct operation the allocated RX buffer has to be one element\n    greater than maximum packet size expected to be received."]
    pub rxBuffer: *mut uint8,
    #[doc = " Size of the TX buffer in bytes/words(depends on txDataBits parameter).\n  A value equal to the TX FIFO depth implies the usage of buffering in\n  hardware. A value greater than the TX FIFO depth results in a software\n  buffer.\n  - The RX and TX FIFO depth is equal to 8 bytes/words for PSoC 4100 /\n    PSoC 4200 devices.\n  - The RX and TX FIFO depth is equal to 8 bytes/words or 16\n    bytes (Byte mode is enabled) for PSoC 4100 BLE / PSoC 4200 BLE /\n    PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n    PSoC Analog Coprocessor devices."]
    pub txBufferSize: uint32,
    #[doc = " Buffer space provided for a TX software buffer:\n  - A NULL pointer must be provided to use hardware buffering.\n  - A pointer to an allocated buffer must be provided to use software\n    buffering. The buffer size must equal txBufferSize if dataBitsTx is\n    less or equal to 8, otherwise (2* txBufferSize)."]
    pub txBuffer: *mut uint8,
    #[doc = " Enables multiprocessor mode: 0  disable, 1  enable."]
    pub enableMultiproc: uint32,
    #[doc = " Enables matched address to be accepted: 0  disable, 1  enable."]
    pub multiprocAcceptAddr: uint32,
    #[doc = " 8 bit address to match in Multiprocessor mode. Ignored for other modes."]
    pub multiprocAddr: uint32,
    #[doc = " 8 bit mask of address bits that are compared for a Multiprocessor\n  address match. Ignored for other modes.\n  - Bit value 0  excludes bit from address comparison.\n  - Bit value 1  the bit needs to match with the corresponding bit\n   of the device address."]
    pub multiprocAddrMask: uint32,
    #[doc = " Enables component interrupt: 0  disable, 1  enable.\n  The interrupt has to be enabled if software buffer is used."]
    pub enableInterrupt: uint32,
    #[doc = " Mask of interrupt sources to enable in the RX direction. This mask is\n  written regardless of the setting of the enableInterrupt field.\n  Multiple sources are enabled by providing a value that is the OR of\n  all of the following sources to enable:\n  - UART_INTR_RX_FIFO_LEVEL\n  - UART_INTR_RX_NOT_EMPTY\n  - UART_INTR_RX_FULL\n  - UART_INTR_RX_OVERFLOW\n  - UART_INTR_RX_UNDERFLOW\n  - UART_INTR_RX_FRAME_ERROR\n  - UART_INTR_RX_PARITY_ERROR"]
    pub rxInterruptMask: uint32,
    #[doc = " FIFO level for an RX FIFO level interrupt. This value is written\n  regardless of whether the RX FIFO level interrupt source is enabled."]
    pub rxTriggerLevel: uint32,
    #[doc = " Mask of interrupt sources to enable in the TX direction. This mask is\n  written regardless of the setting of the enableInterrupt field.\n  Multiple sources are enabled by providing a value that is the OR of\n  all of the following sources to enable:\n  - UART_INTR_TX_FIFO_LEVEL\n  - UART_INTR_TX_NOT_FULL\n  - UART_INTR_TX_EMPTY\n  - UART_INTR_TX_OVERFLOW\n  - UART_INTR_TX_UNDERFLOW\n  - UART_INTR_TX_UART_DONE\n  - UART_INTR_TX_UART_NACK\n  - UART_INTR_TX_UART_ARB_LOST"]
    pub txInterruptMask: uint32,
    #[doc = " FIFO level for a TX FIFO level interrupt. This value is written\n  regardless of whether the TX FIFO level interrupt source is enabled."]
    pub txTriggerLevel: uint32,
    #[doc = " When enabled the TX and RX FIFO depth is doubled and equal to\n  16 bytes: 0  disable, 1  enable. This implies that number of\n  Data bits must be less than or equal to 8.\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub enableByteMode: uint8,
    #[doc = " Enables usage of CTS input signal by the UART transmitter : 0  disable,\n  1  enable.\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub enableCts: uint8,
    #[doc = " Sets active polarity of CTS input signal:\n  - UART_UART_CTS_ACTIVE_LOW\n  - UART_UART_CTS_ACTIVE_HIGH\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub ctsPolarity: uint8,
    #[doc = " RX FIFO level for RTS signal activation. While the RX FIFO has fewer\n  entries than the RTS FIFO level value the RTS signal remains active,\n  otherwise the RTS signal becomes inactive. By setting this field to 0,\n  RTS signal activation is disabled.\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub rtsRxFifoLevel: uint8,
    #[doc = " Sets active polarity of RTS output signal:\n  - UART_UART_RTS_ ACTIVE_LOW\n  - UART_UART_RTS_ACTIVE_HIGH\n\n  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n  PSoC Analog Coprocessor."]
    pub rtsPolarity: uint8,
    #[doc = " Configures the width of a break signal in that triggers the break\n  detection interrupt source. A Break is a low level on the RX line.\n  Valid range is 1-16 UART bits times."]
    pub breakWidth: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UART_UART_INIT_STRUCT"][::core::mem::size_of::<UART_UART_INIT_STRUCT>() - 112usize];
    ["Alignment of UART_UART_INIT_STRUCT"]
        [::core::mem::align_of::<UART_UART_INIT_STRUCT>() - 4usize];
    ["Offset of field: UART_UART_INIT_STRUCT::mode"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, mode) - 0usize];
    ["Offset of field: UART_UART_INIT_STRUCT::direction"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, direction) - 4usize];
    ["Offset of field: UART_UART_INIT_STRUCT::dataBits"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, dataBits) - 8usize];
    ["Offset of field: UART_UART_INIT_STRUCT::parity"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, parity) - 12usize];
    ["Offset of field: UART_UART_INIT_STRUCT::stopBits"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, stopBits) - 16usize];
    ["Offset of field: UART_UART_INIT_STRUCT::oversample"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, oversample) - 20usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableIrdaLowPower"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableIrdaLowPower) - 24usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableMedianFilter"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableMedianFilter) - 28usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableRetryNack"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableRetryNack) - 32usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableInvertedRx"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableInvertedRx) - 36usize];
    ["Offset of field: UART_UART_INIT_STRUCT::dropOnParityErr"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, dropOnParityErr) - 40usize];
    ["Offset of field: UART_UART_INIT_STRUCT::dropOnFrameErr"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, dropOnFrameErr) - 44usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableWake"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableWake) - 48usize];
    ["Offset of field: UART_UART_INIT_STRUCT::rxBufferSize"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, rxBufferSize) - 52usize];
    ["Offset of field: UART_UART_INIT_STRUCT::rxBuffer"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, rxBuffer) - 56usize];
    ["Offset of field: UART_UART_INIT_STRUCT::txBufferSize"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, txBufferSize) - 60usize];
    ["Offset of field: UART_UART_INIT_STRUCT::txBuffer"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, txBuffer) - 64usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableMultiproc"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableMultiproc) - 68usize];
    ["Offset of field: UART_UART_INIT_STRUCT::multiprocAcceptAddr"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, multiprocAcceptAddr) - 72usize];
    ["Offset of field: UART_UART_INIT_STRUCT::multiprocAddr"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, multiprocAddr) - 76usize];
    ["Offset of field: UART_UART_INIT_STRUCT::multiprocAddrMask"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, multiprocAddrMask) - 80usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableInterrupt"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableInterrupt) - 84usize];
    ["Offset of field: UART_UART_INIT_STRUCT::rxInterruptMask"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, rxInterruptMask) - 88usize];
    ["Offset of field: UART_UART_INIT_STRUCT::rxTriggerLevel"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, rxTriggerLevel) - 92usize];
    ["Offset of field: UART_UART_INIT_STRUCT::txInterruptMask"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, txInterruptMask) - 96usize];
    ["Offset of field: UART_UART_INIT_STRUCT::txTriggerLevel"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, txTriggerLevel) - 100usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableByteMode"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableByteMode) - 104usize];
    ["Offset of field: UART_UART_INIT_STRUCT::enableCts"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, enableCts) - 105usize];
    ["Offset of field: UART_UART_INIT_STRUCT::ctsPolarity"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, ctsPolarity) - 106usize];
    ["Offset of field: UART_UART_INIT_STRUCT::rtsRxFifoLevel"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, rtsRxFifoLevel) - 107usize];
    ["Offset of field: UART_UART_INIT_STRUCT::rtsPolarity"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, rtsPolarity) - 108usize];
    ["Offset of field: UART_UART_INIT_STRUCT::breakWidth"]
        [::core::mem::offset_of!(UART_UART_INIT_STRUCT, breakWidth) - 109usize];
};
unsafe extern "C" {
    pub fn UART_UartSetRxAddress(address: uint32);
}
unsafe extern "C" {
    pub fn UART_UartSetRxAddressMask(addressMask: uint32);
}
unsafe extern "C" {
    pub fn UART_UartGetChar() -> uint32;
}
unsafe extern "C" {
    pub fn UART_UartGetByte() -> uint32;
}
unsafe extern "C" {
    pub fn UART_UartPutString(string: *const char8);
}
unsafe extern "C" {
    pub fn UART_UartPutCRLF(txDataByte: uint32);
}
unsafe extern "C" {
    pub fn UART_UartSendBreakBlocking(breakWidth: uint32);
}
unsafe extern "C" {
    pub fn UART_SpiUartReadRxData() -> uint32;
}
unsafe extern "C" {
    pub fn UART_SpiUartGetRxBufferSize() -> uint32;
}
unsafe extern "C" {
    pub fn UART_SpiUartClearRxBuffer();
}
unsafe extern "C" {
    pub fn UART_SpiUartWriteTxData(txData: uint32);
}
unsafe extern "C" {
    pub fn UART_SpiUartPutArray(wrBuf: *const uint8, count: uint32);
}
unsafe extern "C" {
    pub fn UART_SpiUartGetTxBufferSize() -> uint32;
}
unsafe extern "C" {
    pub fn UART_SpiUartClearTxBuffer();
}
unsafe extern "C" {
    #[doc = " @} spi_uart"]
    pub fn UART_SPI_UART_ISR();
}
unsafe extern "C" {
    pub static mut UART_rxBufferHead: uint32;
}
unsafe extern "C" {
    pub static mut UART_rxBufferTail: uint32;
}
unsafe extern "C" {
    #[doc = " Sets when internal software receive buffer overflow\n  was occurred."]
    pub static mut UART_rxBufferOverflow: uint8;
}
unsafe extern "C" {
    pub static mut UART_rxBufferInternal: [uint8; 31usize];
}
unsafe extern "C" {
    #[doc = "     Private Function Prototypes"]
    pub fn UART_SpiPostEnable();
}
unsafe extern "C" {
    pub fn UART_SpiStop();
}
unsafe extern "C" {
    pub fn UART_UartPostEnable();
}
unsafe extern "C" {
    pub fn UART_UartStop();
}
unsafe extern "C" {
    pub fn UART_UartInit();
}
unsafe extern "C" {
    pub fn UART_SpiUartDisableIntRx() -> uint32;
}
unsafe extern "C" {
    pub fn UART_SpiUartDisableIntTx() -> uint32;
}
unsafe extern "C" {
    pub static mut UART_customIntrHandler: cyisraddress;
}
unsafe extern "C" {
    pub static mut UART_backup: UART_BACKUP_STRUCT;
}
unsafe extern "C" {
    pub static mut UART_IntrTxMask: uint16;
}
#[doc = " Internal Type defines"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DecX_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DecX_BACKUP_STRUCT"][::core::mem::size_of::<DecX_BACKUP_STRUCT>() - 1usize];
    ["Alignment of DecX_BACKUP_STRUCT"][::core::mem::align_of::<DecX_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: DecX_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(DecX_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    #[doc = " Variables"]
    pub static mut DecX_initVar: uint8;
}
unsafe extern "C" {
    #[doc = "        Function Prototypes"]
    pub fn DecX_Init();
}
unsafe extern "C" {
    pub fn DecX_Enable();
}
unsafe extern "C" {
    pub fn DecX_Start();
}
unsafe extern "C" {
    pub fn DecX_Stop();
}
unsafe extern "C" {
    pub fn DecX_SetMode(mode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetCounterMode(counterMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetPWMMode(modeMask: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetQDMode(qdMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetPrescaler(prescaler: uint32);
}
unsafe extern "C" {
    pub fn DecX_TriggerCommand(mask: uint32, command: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetOneShot(oneShotEnable: uint32);
}
unsafe extern "C" {
    pub fn DecX_ReadStatus() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_SetPWMSyncKill(syncKillEnable: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetPWMStopOnKill(stopOnKillEnable: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetPWMDeadTime(deadTime: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetPWMInvert(mask: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetInterruptMode(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecX_GetInterruptSourceMasked() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_GetInterruptSource() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_ClearInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecX_WriteCounter(count: uint32);
}
unsafe extern "C" {
    pub fn DecX_ReadCounter() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_ReadCapture() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_ReadCaptureBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_WritePeriod(period: uint32);
}
unsafe extern "C" {
    pub fn DecX_ReadPeriod() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_WritePeriodBuf(periodBuf: uint32);
}
unsafe extern "C" {
    pub fn DecX_ReadPeriodBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_WriteCompare(compare: uint32);
}
unsafe extern "C" {
    pub fn DecX_ReadCompare() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_WriteCompareBuf(compareBuf: uint32);
}
unsafe extern "C" {
    pub fn DecX_ReadCompareBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecX_SetPeriodSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetCompareSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetCaptureMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetReloadMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetStartMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetStopMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SetCountMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecX_SaveConfig();
}
unsafe extern "C" {
    pub fn DecX_RestoreConfig();
}
unsafe extern "C" {
    pub fn DecX_Sleep();
}
unsafe extern "C" {
    pub fn DecX_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EN_GND_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EN_GND_BACKUP_STRUCT"][::core::mem::size_of::<EN_GND_BACKUP_STRUCT>() - 12usize];
    ["Alignment of EN_GND_BACKUP_STRUCT"][::core::mem::align_of::<EN_GND_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: EN_GND_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(EN_GND_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: EN_GND_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(EN_GND_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: EN_GND_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(EN_GND_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn EN_GND_Read() -> uint8;
}
unsafe extern "C" {
    pub fn EN_GND_Write(value: uint8);
}
unsafe extern "C" {
    pub fn EN_GND_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn EN_GND_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn EN_GND_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn EN_GND_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn EN_GND_Sleep();
}
unsafe extern "C" {
    pub fn EN_GND_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct I2CS_scl_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of I2CS_scl_BACKUP_STRUCT"][::core::mem::size_of::<I2CS_scl_BACKUP_STRUCT>() - 12usize];
    ["Alignment of I2CS_scl_BACKUP_STRUCT"]
        [::core::mem::align_of::<I2CS_scl_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: I2CS_scl_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(I2CS_scl_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: I2CS_scl_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(I2CS_scl_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: I2CS_scl_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(I2CS_scl_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn I2CS_scl_Read() -> uint8;
}
unsafe extern "C" {
    pub fn I2CS_scl_Write(value: uint8);
}
unsafe extern "C" {
    pub fn I2CS_scl_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn I2CS_scl_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn I2CS_scl_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn I2CS_scl_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn I2CS_scl_Sleep();
}
unsafe extern "C" {
    pub fn I2CS_scl_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct I2CS_sda_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of I2CS_sda_BACKUP_STRUCT"][::core::mem::size_of::<I2CS_sda_BACKUP_STRUCT>() - 12usize];
    ["Alignment of I2CS_sda_BACKUP_STRUCT"]
        [::core::mem::align_of::<I2CS_sda_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: I2CS_sda_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(I2CS_sda_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: I2CS_sda_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(I2CS_sda_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: I2CS_sda_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(I2CS_sda_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn I2CS_sda_Read() -> uint8;
}
unsafe extern "C" {
    pub fn I2CS_sda_Write(value: uint8);
}
unsafe extern "C" {
    pub fn I2CS_sda_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn I2CS_sda_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn I2CS_sda_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn I2CS_sda_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn I2CS_sda_Sleep();
}
unsafe extern "C" {
    pub fn I2CS_sda_Wakeup();
}
unsafe extern "C" {
    pub fn I2CS_SCBCLK_Start();
}
unsafe extern "C" {
    pub fn I2CS_SCBCLK_Stop();
}
unsafe extern "C" {
    pub fn I2CS_SCBCLK_SetFractionalDividerRegister(clkDivider: uint16, clkFractional: uint8);
}
unsafe extern "C" {
    pub fn I2CS_SCBCLK_GetDividerRegister() -> uint16;
}
unsafe extern "C" {
    pub fn I2CS_SCBCLK_GetFractionalDividerRegister() -> uint8;
}
#[doc = "       Type Definitions"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct I2CS_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of I2CS_BACKUP_STRUCT"][::core::mem::size_of::<I2CS_BACKUP_STRUCT>() - 1usize];
    ["Alignment of I2CS_BACKUP_STRUCT"][::core::mem::align_of::<I2CS_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: I2CS_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(I2CS_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    #[doc = " \\addtogroup group_general\n @{"]
    pub fn I2CS_Init();
}
unsafe extern "C" {
    pub fn I2CS_Enable();
}
unsafe extern "C" {
    pub fn I2CS_Start();
}
unsafe extern "C" {
    pub fn I2CS_Stop();
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn I2CS_Sleep();
}
unsafe extern "C" {
    pub fn I2CS_Wakeup();
}
unsafe extern "C" {
    pub fn I2CS_SetCustomInterruptHandler(func: ::core::option::Option<unsafe extern "C" fn()>);
}
unsafe extern "C" {
    pub fn I2CS_SetRxFifoLevel(level: uint32);
}
unsafe extern "C" {
    pub fn I2CS_SetTxFifoLevel(level: uint32);
}
unsafe extern "C" {
    #[doc = " I2CS_initVar indicates whether the I2CS\n  component has been initialized. The variable is initialized to 0\n  and set to 1 the first time SCB_Start() is called. This allows\n  the component to restart without reinitialization after the first\n  call to the I2CS_Start() routine.\n\n  If re-initialization of the component is required, then the\n  I2CS_Init() function can be called before the\n  I2CS_Start() or I2CS_Enable() function."]
    pub static mut I2CS_initVar: uint8;
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveNackGeneration();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct I2CS_I2C_INIT_STRUCT {
    #[doc = " Mode of operation for I2C. The following defines are available choices:\n  - I2CS_I2C_MODE_SLAVE\n  - I2CS_I2C_MODE_MASTER\n  - I2CS_I2C_MODE_MULTI_MASTER\n  - I2CS_I2C_MODE_MULTI_MASTER_SLAVE"]
    pub mode: uint32,
    #[doc = " Oversampling factor for the low phase of the I2C clock. Ignored for\n  Slave mode operation.  The oversampling factors need to be chosen in\n  conjunction with the clock rate in order to generate the desired rate\n  of I2C operation."]
    pub oversampleLow: uint32,
    #[doc = " Oversampling factor for the high phase of the I2C clock. Ignored for\n  Slave mode operation."]
    pub oversampleHigh: uint32,
    #[doc = " This field is left for compatibility and its value is ignored.\n  Median filter is enabled or disabled depends on the data rate and\n  operation mode."]
    pub enableMedianFilter: uint32,
    #[doc = " 7-bit slave address. Ignored for non-slave modes."]
    pub slaveAddr: uint32,
    #[doc = " 8-bit slave address mask. Bit 0 must have a value of 0. Ignored for\n  non-slave modes.\n  - Bit value 0  excludes bit from address comparison.\n  - Bit value 1  the bit needs to match with the corresponding bit\n   of the device address."]
    pub slaveAddrMask: uint32,
    #[doc = " When enabled the matching address is received into the RX FIFO:\n  0  disable, 1  enable.\n\n  The callback function has to be registered to handle the address\n  accepted in the RX FIFO. Refer to section Accept matching address\n  RX FIFO for more information."]
    pub acceptAddr: uint32,
    #[doc = " When enabled the matching address generates a wakeup request:\n  0  disable, 1  enable. 1  enable. Ignored for non-slave modes."]
    pub enableWake: uint32,
    #[doc = " When enabled the TX and RX FIFO depth is doubled and equal to\n  16 bytes: 0  disable, 1  enable.\n\n Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /\n PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /\n PSoC Analog Coprocessor."]
    pub enableByteMode: uint8,
    #[doc = " Data rate in kbps used while the of I2C is in operation. Valid values\n are between 1 and 1000. Note that this filed must be initialized\n for correct operation if Unconfigured SCB was utilized with previous\n version of the component."]
    pub dataRate: uint16,
    #[doc = " When enabled the I2C general call address (0x00) will be accepted by\n  the I2C hardware and trigger an interrupt: 0  disable, 1  enable.\n\n  The callback function has to be registered to handle a general call\n  address. Refer to section Accept General Call for more information."]
    pub acceptGeneralAddr: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of I2CS_I2C_INIT_STRUCT"][::core::mem::size_of::<I2CS_I2C_INIT_STRUCT>() - 40usize];
    ["Alignment of I2CS_I2C_INIT_STRUCT"][::core::mem::align_of::<I2CS_I2C_INIT_STRUCT>() - 4usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::mode"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, mode) - 0usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::oversampleLow"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, oversampleLow) - 4usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::oversampleHigh"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, oversampleHigh) - 8usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::enableMedianFilter"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, enableMedianFilter) - 12usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::slaveAddr"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, slaveAddr) - 16usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::slaveAddrMask"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, slaveAddrMask) - 20usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::acceptAddr"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, acceptAddr) - 24usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::enableWake"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, enableWake) - 28usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::enableByteMode"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, enableByteMode) - 32usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::dataRate"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, dataRate) - 34usize];
    ["Offset of field: I2CS_I2C_INIT_STRUCT::acceptGeneralAddr"]
        [::core::mem::offset_of!(I2CS_I2C_INIT_STRUCT, acceptGeneralAddr) - 36usize];
};
unsafe extern "C" {
    pub fn I2CS_I2CSlaveStatus() -> uint32;
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveClearReadStatus() -> uint32;
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveClearWriteStatus() -> uint32;
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveSetAddress(address: uint32);
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveSetAddressMask(addressMask: uint32);
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveInitReadBuf(rdBuf: *mut uint8, bufSize: uint32);
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveInitWriteBuf(wrBuf: *mut uint8, bufSize: uint32);
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveGetReadBufSize() -> uint32;
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveGetWriteBufSize() -> uint32;
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveClearReadBuf();
}
unsafe extern "C" {
    pub fn I2CS_I2CSlaveClearWriteBuf();
}
unsafe extern "C" {
    #[doc = " @} i2c"]
    pub fn I2CS_I2C_ISR();
}
unsafe extern "C" {
    #[doc = "     Private Global Vars"]
    pub static mut I2CS_state: uint8;
}
unsafe extern "C" {
    pub static mut I2CS_slStatus: uint8;
}
unsafe extern "C" {
    pub static mut I2CS_slWrBufPtr: *mut uint8;
}
unsafe extern "C" {
    pub static mut I2CS_slWrBufSize: uint32;
}
unsafe extern "C" {
    pub static mut I2CS_slWrBufIndex: uint32;
}
unsafe extern "C" {
    pub static mut I2CS_slRdBufPtr: *mut uint8;
}
unsafe extern "C" {
    pub static mut I2CS_slRdBufSize: uint32;
}
unsafe extern "C" {
    pub static mut I2CS_slRdBufIndex: uint32;
}
unsafe extern "C" {
    pub static mut I2CS_slRdBufIndexTmp: uint32;
}
unsafe extern "C" {
    pub static mut I2CS_slOverFlowCount: uint8;
}
unsafe extern "C" {
    pub fn I2CS_I2CInit();
}
unsafe extern "C" {
    pub fn I2CS_I2CStop();
}
unsafe extern "C" {
    pub fn I2CS_I2CFwBlockReset();
}
unsafe extern "C" {
    pub fn I2CS_I2CSaveConfig();
}
unsafe extern "C" {
    pub fn I2CS_I2CRestoreConfig();
}
unsafe extern "C" {
    pub static mut I2CS_customIntrHandler: cyisraddress;
}
unsafe extern "C" {
    pub static mut I2CS_backup: I2CS_BACKUP_STRUCT;
}
unsafe extern "C" {
    pub fn ISR_QDecL_Start();
}
unsafe extern "C" {
    pub fn ISR_QDecL_StartEx(address: cyisraddress);
}
unsafe extern "C" {
    pub fn ISR_QDecL_Stop();
}
unsafe extern "C" {
    pub fn ISR_QDecL_Interrupt();
}
unsafe extern "C" {
    pub fn ISR_QDecL_SetVector(address: cyisraddress);
}
unsafe extern "C" {
    pub fn ISR_QDecL_GetVector() -> cyisraddress;
}
unsafe extern "C" {
    pub fn ISR_QDecL_SetPriority(priority: uint8);
}
unsafe extern "C" {
    pub fn ISR_QDecL_GetPriority() -> uint8;
}
unsafe extern "C" {
    pub fn ISR_QDecL_Enable();
}
unsafe extern "C" {
    pub fn ISR_QDecL_GetState() -> uint8;
}
unsafe extern "C" {
    pub fn ISR_QDecL_Disable();
}
unsafe extern "C" {
    pub fn ISR_QDecL_SetPending();
}
unsafe extern "C" {
    pub fn ISR_QDecL_ClearPending();
}
#[doc = " Internal Type defines"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pulser_tmr_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Pulser_tmr_BACKUP_STRUCT"]
        [::core::mem::size_of::<Pulser_tmr_BACKUP_STRUCT>() - 1usize];
    ["Alignment of Pulser_tmr_BACKUP_STRUCT"]
        [::core::mem::align_of::<Pulser_tmr_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: Pulser_tmr_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(Pulser_tmr_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    #[doc = " Variables"]
    pub static mut Pulser_tmr_initVar: uint8;
}
unsafe extern "C" {
    #[doc = "        Function Prototypes"]
    pub fn Pulser_tmr_Init();
}
unsafe extern "C" {
    pub fn Pulser_tmr_Enable();
}
unsafe extern "C" {
    pub fn Pulser_tmr_Start();
}
unsafe extern "C" {
    pub fn Pulser_tmr_Stop();
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetMode(mode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetCounterMode(counterMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPWMMode(modeMask: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetQDMode(qdMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPrescaler(prescaler: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_TriggerCommand(mask: uint32, command: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetOneShot(oneShotEnable: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadStatus() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPWMSyncKill(syncKillEnable: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPWMStopOnKill(stopOnKillEnable: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPWMDeadTime(deadTime: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPWMInvert(mask: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetInterruptMode(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_GetInterruptSourceMasked() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_GetInterruptSource() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_ClearInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_WriteCounter(count: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadCounter() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadCapture() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadCaptureBuf() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_WritePeriod(period: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadPeriod() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_WritePeriodBuf(periodBuf: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadPeriodBuf() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_WriteCompare(compare: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadCompare() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_WriteCompareBuf(compareBuf: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_ReadCompareBuf() -> uint32;
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetPeriodSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetCompareSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetCaptureMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetReloadMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetStartMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetStopMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SetCountMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn Pulser_tmr_SaveConfig();
}
unsafe extern "C" {
    pub fn Pulser_tmr_RestoreConfig();
}
unsafe extern "C" {
    pub fn Pulser_tmr_Sleep();
}
unsafe extern "C" {
    pub fn Pulser_tmr_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stepY_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stepY_BACKUP_STRUCT"][::core::mem::size_of::<stepY_BACKUP_STRUCT>() - 12usize];
    ["Alignment of stepY_BACKUP_STRUCT"][::core::mem::align_of::<stepY_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: stepY_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(stepY_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: stepY_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(stepY_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: stepY_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(stepY_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn stepY_Read() -> uint8;
}
unsafe extern "C" {
    pub fn stepY_Write(value: uint8);
}
unsafe extern "C" {
    pub fn stepY_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn stepY_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn stepY_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn stepY_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn stepY_Sleep();
}
unsafe extern "C" {
    pub fn stepY_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stepZ_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stepZ_BACKUP_STRUCT"][::core::mem::size_of::<stepZ_BACKUP_STRUCT>() - 12usize];
    ["Alignment of stepZ_BACKUP_STRUCT"][::core::mem::align_of::<stepZ_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: stepZ_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(stepZ_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: stepZ_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(stepZ_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: stepZ_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(stepZ_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn stepZ_Read() -> uint8;
}
unsafe extern "C" {
    pub fn stepZ_Write(value: uint8);
}
unsafe extern "C" {
    pub fn stepZ_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn stepZ_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn stepZ_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn stepZ_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn stepZ_Sleep();
}
unsafe extern "C" {
    pub fn stepZ_Wakeup();
}
#[doc = " Internal Type defines"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IDAC_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IDAC_BACKUP_STRUCT"][::core::mem::size_of::<IDAC_BACKUP_STRUCT>() - 1usize];
    ["Alignment of IDAC_BACKUP_STRUCT"][::core::mem::align_of::<IDAC_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: IDAC_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(IDAC_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    pub static mut IDAC_initVar: uint32;
}
unsafe extern "C" {
    #[doc = "        Function Prototypes"]
    pub fn IDAC_Init();
}
unsafe extern "C" {
    pub fn IDAC_Enable();
}
unsafe extern "C" {
    pub fn IDAC_Start();
}
unsafe extern "C" {
    pub fn IDAC_Stop();
}
unsafe extern "C" {
    pub fn IDAC_SetValue(value: uint32);
}
unsafe extern "C" {
    pub fn IDAC_SaveConfig();
}
unsafe extern "C" {
    pub fn IDAC_Sleep();
}
unsafe extern "C" {
    pub fn IDAC_RestoreConfig();
}
unsafe extern "C" {
    pub fn IDAC_Wakeup();
}
#[doc = "      Data Struct Definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_SAR_Seq_BACKUP_STRUCT {
    pub enableState: uint8,
    pub dftRegVal: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ADC_SAR_Seq_BACKUP_STRUCT"]
        [::core::mem::size_of::<ADC_SAR_Seq_BACKUP_STRUCT>() - 8usize];
    ["Alignment of ADC_SAR_Seq_BACKUP_STRUCT"]
        [::core::mem::align_of::<ADC_SAR_Seq_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: ADC_SAR_Seq_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(ADC_SAR_Seq_BACKUP_STRUCT, enableState) - 0usize];
    ["Offset of field: ADC_SAR_Seq_BACKUP_STRUCT::dftRegVal"]
        [::core::mem::offset_of!(ADC_SAR_Seq_BACKUP_STRUCT, dftRegVal) - 4usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes"]
    pub fn ADC_SAR_Seq_Start();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_Stop();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_Init();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_Enable();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_StartConvert();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_StopConvert();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IsEndConversion(retMode: uint32) -> uint32;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_GetResult16(chan: uint32) -> int16;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetChanMask(mask: uint32);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetLowLimit(lowLimit: uint32);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetHighLimit(highLimit: uint32);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetLimitMask(mask: uint32);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetSatMask(mask: uint32);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetOffset(chan: uint32, offset: int16);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SetGain(chan: uint32, adcGain: int32);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_CountsTo_mVolts(chan: uint32, adcCounts: int16) -> int16;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_CountsTo_uVolts(chan: uint32, adcCounts: int16) -> int32;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_CountsTo_Volts(chan: uint32, adcCounts: int16) -> float32;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_Sleep();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_Wakeup();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_SaveConfig();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_RestoreConfig();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_ISR();
}
unsafe extern "C" {
    #[doc = " Global variables external identifier"]
    pub static mut ADC_SAR_Seq_initVar: uint8;
}
unsafe extern "C" {
    pub static mut ADC_SAR_Seq_offset: [int16; 1usize];
}
unsafe extern "C" {
    pub static mut ADC_SAR_Seq_countsPer10Volt: [int32; 1usize];
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Iref_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Iref_BACKUP_STRUCT"][::core::mem::size_of::<Iref_BACKUP_STRUCT>() - 12usize];
    ["Alignment of Iref_BACKUP_STRUCT"][::core::mem::align_of::<Iref_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: Iref_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(Iref_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: Iref_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(Iref_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: Iref_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(Iref_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn Iref_Read() -> uint8;
}
unsafe extern "C" {
    pub fn Iref_Write(value: uint8);
}
unsafe extern "C" {
    pub fn Iref_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn Iref_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn Iref_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn Iref_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn Iref_Sleep();
}
unsafe extern "C" {
    pub fn Iref_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SPD_REF_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SPD_REF_BACKUP_STRUCT"][::core::mem::size_of::<SPD_REF_BACKUP_STRUCT>() - 12usize];
    ["Alignment of SPD_REF_BACKUP_STRUCT"]
        [::core::mem::align_of::<SPD_REF_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: SPD_REF_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(SPD_REF_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: SPD_REF_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(SPD_REF_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: SPD_REF_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(SPD_REF_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn SPD_REF_Read() -> uint8;
}
unsafe extern "C" {
    pub fn SPD_REF_Write(value: uint8);
}
unsafe extern "C" {
    pub fn SPD_REF_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn SPD_REF_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn SPD_REF_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn SPD_REF_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn SPD_REF_Sleep();
}
unsafe extern "C" {
    pub fn SPD_REF_Wakeup();
}
#[doc = " Internal Type defines"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DecY_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DecY_BACKUP_STRUCT"][::core::mem::size_of::<DecY_BACKUP_STRUCT>() - 1usize];
    ["Alignment of DecY_BACKUP_STRUCT"][::core::mem::align_of::<DecY_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: DecY_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(DecY_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    #[doc = " Variables"]
    pub static mut DecY_initVar: uint8;
}
unsafe extern "C" {
    #[doc = "        Function Prototypes"]
    pub fn DecY_Init();
}
unsafe extern "C" {
    pub fn DecY_Enable();
}
unsafe extern "C" {
    pub fn DecY_Start();
}
unsafe extern "C" {
    pub fn DecY_Stop();
}
unsafe extern "C" {
    pub fn DecY_SetMode(mode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetCounterMode(counterMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetPWMMode(modeMask: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetQDMode(qdMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetPrescaler(prescaler: uint32);
}
unsafe extern "C" {
    pub fn DecY_TriggerCommand(mask: uint32, command: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetOneShot(oneShotEnable: uint32);
}
unsafe extern "C" {
    pub fn DecY_ReadStatus() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_SetPWMSyncKill(syncKillEnable: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetPWMStopOnKill(stopOnKillEnable: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetPWMDeadTime(deadTime: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetPWMInvert(mask: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetInterruptMode(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecY_GetInterruptSourceMasked() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_GetInterruptSource() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_ClearInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecY_WriteCounter(count: uint32);
}
unsafe extern "C" {
    pub fn DecY_ReadCounter() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_ReadCapture() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_ReadCaptureBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_WritePeriod(period: uint32);
}
unsafe extern "C" {
    pub fn DecY_ReadPeriod() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_WritePeriodBuf(periodBuf: uint32);
}
unsafe extern "C" {
    pub fn DecY_ReadPeriodBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_WriteCompare(compare: uint32);
}
unsafe extern "C" {
    pub fn DecY_ReadCompare() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_WriteCompareBuf(compareBuf: uint32);
}
unsafe extern "C" {
    pub fn DecY_ReadCompareBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecY_SetPeriodSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetCompareSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetCaptureMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetReloadMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetStartMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetStopMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SetCountMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecY_SaveConfig();
}
unsafe extern "C" {
    pub fn DecY_RestoreConfig();
}
unsafe extern "C" {
    pub fn DecY_Sleep();
}
unsafe extern "C" {
    pub fn DecY_Wakeup();
}
#[doc = " Internal Type defines"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DecZ_BACKUP_STRUCT {
    pub enableState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DecZ_BACKUP_STRUCT"][::core::mem::size_of::<DecZ_BACKUP_STRUCT>() - 1usize];
    ["Alignment of DecZ_BACKUP_STRUCT"][::core::mem::align_of::<DecZ_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: DecZ_BACKUP_STRUCT::enableState"]
        [::core::mem::offset_of!(DecZ_BACKUP_STRUCT, enableState) - 0usize];
};
unsafe extern "C" {
    #[doc = " Variables"]
    pub static mut DecZ_initVar: uint8;
}
unsafe extern "C" {
    #[doc = "        Function Prototypes"]
    pub fn DecZ_Init();
}
unsafe extern "C" {
    pub fn DecZ_Enable();
}
unsafe extern "C" {
    pub fn DecZ_Start();
}
unsafe extern "C" {
    pub fn DecZ_Stop();
}
unsafe extern "C" {
    pub fn DecZ_SetMode(mode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetCounterMode(counterMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetPWMMode(modeMask: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetQDMode(qdMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetPrescaler(prescaler: uint32);
}
unsafe extern "C" {
    pub fn DecZ_TriggerCommand(mask: uint32, command: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetOneShot(oneShotEnable: uint32);
}
unsafe extern "C" {
    pub fn DecZ_ReadStatus() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_SetPWMSyncKill(syncKillEnable: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetPWMStopOnKill(stopOnKillEnable: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetPWMDeadTime(deadTime: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetPWMInvert(mask: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetInterruptMode(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecZ_GetInterruptSourceMasked() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_GetInterruptSource() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_ClearInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetInterrupt(interruptMask: uint32);
}
unsafe extern "C" {
    pub fn DecZ_WriteCounter(count: uint32);
}
unsafe extern "C" {
    pub fn DecZ_ReadCounter() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_ReadCapture() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_ReadCaptureBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_WritePeriod(period: uint32);
}
unsafe extern "C" {
    pub fn DecZ_ReadPeriod() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_WritePeriodBuf(periodBuf: uint32);
}
unsafe extern "C" {
    pub fn DecZ_ReadPeriodBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_WriteCompare(compare: uint32);
}
unsafe extern "C" {
    pub fn DecZ_ReadCompare() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_WriteCompareBuf(compareBuf: uint32);
}
unsafe extern "C" {
    pub fn DecZ_ReadCompareBuf() -> uint32;
}
unsafe extern "C" {
    pub fn DecZ_SetPeriodSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetCompareSwap(swapEnable: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetCaptureMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetReloadMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetStartMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetStopMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SetCountMode(triggerMode: uint32);
}
unsafe extern "C" {
    pub fn DecZ_SaveConfig();
}
unsafe extern "C" {
    pub fn DecZ_RestoreConfig();
}
unsafe extern "C" {
    pub fn DecZ_Sleep();
}
unsafe extern "C" {
    pub fn DecZ_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YchA_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YchA_BACKUP_STRUCT"][::core::mem::size_of::<YchA_BACKUP_STRUCT>() - 12usize];
    ["Alignment of YchA_BACKUP_STRUCT"][::core::mem::align_of::<YchA_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: YchA_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(YchA_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: YchA_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(YchA_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: YchA_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(YchA_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn YchA_Read() -> uint8;
}
unsafe extern "C" {
    pub fn YchA_Write(value: uint8);
}
unsafe extern "C" {
    pub fn YchA_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn YchA_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn YchA_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn YchA_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn YchA_Sleep();
}
unsafe extern "C" {
    pub fn YchA_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct YchB_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YchB_BACKUP_STRUCT"][::core::mem::size_of::<YchB_BACKUP_STRUCT>() - 12usize];
    ["Alignment of YchB_BACKUP_STRUCT"][::core::mem::align_of::<YchB_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: YchB_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(YchB_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: YchB_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(YchB_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: YchB_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(YchB_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn YchB_Read() -> uint8;
}
unsafe extern "C" {
    pub fn YchB_Write(value: uint8);
}
unsafe extern "C" {
    pub fn YchB_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn YchB_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn YchB_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn YchB_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn YchB_Sleep();
}
unsafe extern "C" {
    pub fn YchB_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ZchA_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ZchA_BACKUP_STRUCT"][::core::mem::size_of::<ZchA_BACKUP_STRUCT>() - 12usize];
    ["Alignment of ZchA_BACKUP_STRUCT"][::core::mem::align_of::<ZchA_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: ZchA_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(ZchA_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: ZchA_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(ZchA_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: ZchA_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(ZchA_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn ZchA_Read() -> uint8;
}
unsafe extern "C" {
    pub fn ZchA_Write(value: uint8);
}
unsafe extern "C" {
    pub fn ZchA_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn ZchA_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn ZchA_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn ZchA_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn ZchA_Sleep();
}
unsafe extern "C" {
    pub fn ZchA_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ZchB_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ZchB_BACKUP_STRUCT"][::core::mem::size_of::<ZchB_BACKUP_STRUCT>() - 12usize];
    ["Alignment of ZchB_BACKUP_STRUCT"][::core::mem::align_of::<ZchB_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: ZchB_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(ZchB_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: ZchB_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(ZchB_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: ZchB_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(ZchB_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn ZchB_Read() -> uint8;
}
unsafe extern "C" {
    pub fn ZchB_Write(value: uint8);
}
unsafe extern "C" {
    pub fn ZchB_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn ZchB_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn ZchB_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn ZchB_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn ZchB_Sleep();
}
unsafe extern "C" {
    pub fn ZchB_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirX_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dirX_BACKUP_STRUCT"][::core::mem::size_of::<dirX_BACKUP_STRUCT>() - 12usize];
    ["Alignment of dirX_BACKUP_STRUCT"][::core::mem::align_of::<dirX_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: dirX_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(dirX_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: dirX_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(dirX_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: dirX_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(dirX_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn dirX_Read() -> uint8;
}
unsafe extern "C" {
    pub fn dirX_Write(value: uint8);
}
unsafe extern "C" {
    pub fn dirX_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn dirX_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn dirX_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn dirX_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn dirX_Sleep();
}
unsafe extern "C" {
    pub fn dirX_Wakeup();
}
#[doc = "     Data Struct Definitions"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DirReg_BACKUP_STRUCT {
    pub controlState: uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DirReg_BACKUP_STRUCT"][::core::mem::size_of::<DirReg_BACKUP_STRUCT>() - 1usize];
    ["Alignment of DirReg_BACKUP_STRUCT"][::core::mem::align_of::<DirReg_BACKUP_STRUCT>() - 1usize];
    ["Offset of field: DirReg_BACKUP_STRUCT::controlState"]
        [::core::mem::offset_of!(DirReg_BACKUP_STRUCT, controlState) - 0usize];
};
unsafe extern "C" {
    #[doc = "         Function Prototypes"]
    pub fn DirReg_Write(control: uint8);
}
unsafe extern "C" {
    pub fn DirReg_Read() -> uint8;
}
unsafe extern "C" {
    pub fn DirReg_SaveConfig();
}
unsafe extern "C" {
    pub fn DirReg_RestoreConfig();
}
unsafe extern "C" {
    pub fn DirReg_Sleep();
}
unsafe extern "C" {
    pub fn DirReg_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirY_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dirY_BACKUP_STRUCT"][::core::mem::size_of::<dirY_BACKUP_STRUCT>() - 12usize];
    ["Alignment of dirY_BACKUP_STRUCT"][::core::mem::align_of::<dirY_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: dirY_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(dirY_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: dirY_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(dirY_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: dirY_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(dirY_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn dirY_Read() -> uint8;
}
unsafe extern "C" {
    pub fn dirY_Write(value: uint8);
}
unsafe extern "C" {
    pub fn dirY_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn dirY_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn dirY_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn dirY_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn dirY_Sleep();
}
unsafe extern "C" {
    pub fn dirY_Wakeup();
}
#[doc = " \\addtogroup group_structures\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirZ_BACKUP_STRUCT {
    #[doc = "< State of the port control register"]
    pub pcState: uint32,
    #[doc = "< State of the SIO configuration"]
    pub sioState: uint32,
    #[doc = "< State of the USBIO regulator"]
    pub usbState: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dirZ_BACKUP_STRUCT"][::core::mem::size_of::<dirZ_BACKUP_STRUCT>() - 12usize];
    ["Alignment of dirZ_BACKUP_STRUCT"][::core::mem::align_of::<dirZ_BACKUP_STRUCT>() - 4usize];
    ["Offset of field: dirZ_BACKUP_STRUCT::pcState"]
        [::core::mem::offset_of!(dirZ_BACKUP_STRUCT, pcState) - 0usize];
    ["Offset of field: dirZ_BACKUP_STRUCT::sioState"]
        [::core::mem::offset_of!(dirZ_BACKUP_STRUCT, sioState) - 4usize];
    ["Offset of field: dirZ_BACKUP_STRUCT::usbState"]
        [::core::mem::offset_of!(dirZ_BACKUP_STRUCT, usbState) - 8usize];
};
unsafe extern "C" {
    #[doc = "        Function Prototypes\n/\n/**\n \\addtogroup group_general\n @{"]
    pub fn dirZ_Read() -> uint8;
}
unsafe extern "C" {
    pub fn dirZ_Write(value: uint8);
}
unsafe extern "C" {
    pub fn dirZ_ReadDataReg() -> uint8;
}
unsafe extern "C" {
    pub fn dirZ_SetDriveMode(mode: uint8);
}
unsafe extern "C" {
    pub fn dirZ_SetInterruptMode(position: uint16, mode: uint16);
}
unsafe extern "C" {
    pub fn dirZ_ClearInterrupt() -> uint8;
}
unsafe extern "C" {
    #[doc = " \\addtogroup group_power\n @{"]
    pub fn dirZ_Sleep();
}
unsafe extern "C" {
    pub fn dirZ_Wakeup();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_Start();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_StartEx(address: cyisraddress);
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_Stop();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_Interrupt();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_SetVector(address: cyisraddress);
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_GetVector() -> cyisraddress;
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_SetPriority(priority: uint8);
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_GetPriority() -> uint8;
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_Enable();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_GetState() -> uint8;
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_Disable();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_SetPending();
}
unsafe extern "C" {
    pub fn UART_SCB_IRQ_ClearPending();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_Start();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_StartEx(address: cyisraddress);
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_Stop();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_Interrupt();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_SetVector(address: cyisraddress);
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_GetVector() -> cyisraddress;
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_SetPriority(priority: uint8);
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_GetPriority() -> uint8;
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_Enable();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_GetState() -> uint8;
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_Disable();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_SetPending();
}
unsafe extern "C" {
    pub fn I2CS_SCB_IRQ_ClearPending();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_Start();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_StartEx(address: cyisraddress);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_Stop();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_Interrupt();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_SetVector(address: cyisraddress);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_GetVector() -> cyisraddress;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_SetPriority(priority: uint8);
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_GetPriority() -> uint8;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_Enable();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_GetState() -> uint8;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_Disable();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_SetPending();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_IRQ_ClearPending();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_intClock_Start();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_intClock_Stop();
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_intClock_SetFractionalDividerRegister(
        clkDivider: uint16,
        clkFractional: uint8,
    );
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_intClock_GetDividerRegister() -> uint16;
}
unsafe extern "C" {
    pub fn ADC_SAR_Seq_intClock_GetFractionalDividerRegister() -> uint8;
}
#[doc = "< 2 Non Maskable Interrupt"]
pub const IRQn_NonMaskableInt_IRQn: IRQn = -14;
#[doc = "< 3 Cortex-M0 Hard Fault Interrupt"]
pub const IRQn_HardFault_IRQn: IRQn = -13;
#[doc = "< 11 Cortex-M0 SV Call Interrupt"]
pub const IRQn_SVCall_IRQn: IRQn = -5;
#[doc = "< 14 Cortex-M0 Pend SV Interrupt"]
pub const IRQn_PendSV_IRQn: IRQn = -2;
#[doc = "< 15 Cortex-M0 System Tick Interrupt"]
pub const IRQn_SysTick_IRQn: IRQn = -1;
#[doc = " Interrupt Number Definition"]
pub type IRQn = cty::c_int;
#[doc = " Interrupt Number Definition"]
pub use self::IRQn as IRQn_Type;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32 {
    pub v: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of T_UINT32"][::core::mem::size_of::<T_UINT32>() - 4usize];
    ["Alignment of T_UINT32"][::core::mem::align_of::<T_UINT32>() - 1usize];
    ["Offset of field: T_UINT32::v"][::core::mem::offset_of!(T_UINT32, v) - 0usize];
};
#[doc = "\\brief  Union type to access the Application Program Status Register (APSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union APSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: APSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of APSR_Type__bindgen_ty_1"][::core::mem::size_of::<APSR_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of APSR_Type__bindgen_ty_1"]
        [::core::mem::align_of::<APSR_Type__bindgen_ty_1>() - 4usize];
};
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                28u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                28u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn V_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_V_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn C_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_C_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Z_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Z_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn N_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_N_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 28u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of APSR_Type"][::core::mem::size_of::<APSR_Type>() - 4usize];
    ["Alignment of APSR_Type"][::core::mem::align_of::<APSR_Type>() - 4usize];
    ["Offset of field: APSR_Type::b"][::core::mem::offset_of!(APSR_Type, b) - 0usize];
    ["Offset of field: APSR_Type::w"][::core::mem::offset_of!(APSR_Type, w) - 0usize];
};
#[doc = "\\brief  Union type to access the Interrupt Program Status Register (IPSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union IPSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: IPSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IPSR_Type__bindgen_ty_1"][::core::mem::size_of::<IPSR_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of IPSR_Type__bindgen_ty_1"]
        [::core::mem::align_of::<IPSR_Type__bindgen_ty_1>() - 4usize];
};
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ISR_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ISR_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                23u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                23u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IPSR_Type"][::core::mem::size_of::<IPSR_Type>() - 4usize];
    ["Alignment of IPSR_Type"][::core::mem::align_of::<IPSR_Type>() - 4usize];
    ["Offset of field: IPSR_Type::b"][::core::mem::offset_of!(IPSR_Type, b) - 0usize];
    ["Offset of field: IPSR_Type::w"][::core::mem::offset_of!(IPSR_Type, w) - 0usize];
};
#[doc = "\\brief  Union type to access the Special-Purpose Program Status Registers (xPSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union xPSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: xPSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xPSR_Type__bindgen_ty_1"][::core::mem::size_of::<xPSR_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of xPSR_Type__bindgen_ty_1"]
        [::core::mem::align_of::<xPSR_Type__bindgen_ty_1>() - 4usize];
};
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ISR_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ISR_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                15u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                15u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn T_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_T_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved1_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                3u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved1_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn V_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_V_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn C_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_C_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Z_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Z_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn N_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_N_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        T: u32,
        _reserved1: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 15u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::core::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 3u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xPSR_Type"][::core::mem::size_of::<xPSR_Type>() - 4usize];
    ["Alignment of xPSR_Type"][::core::mem::align_of::<xPSR_Type>() - 4usize];
    ["Offset of field: xPSR_Type::b"][::core::mem::offset_of!(xPSR_Type, b) - 0usize];
    ["Offset of field: xPSR_Type::w"][::core::mem::offset_of!(xPSR_Type, w) - 0usize];
};
#[doc = "\\brief  Union type to access the Control Registers (CONTROL)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union CONTROL_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: CONTROL_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CONTROL_Type__bindgen_ty_1"]
        [::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>() - 4usize];
    ["Alignment of CONTROL_Type__bindgen_ty_1"]
        [::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>() - 4usize];
};
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved0_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved0_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SPSEL_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SPSEL_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved1_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                30u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set__reserved1_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                30u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        SPSEL: u32,
        _reserved1: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::core::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CONTROL_Type"][::core::mem::size_of::<CONTROL_Type>() - 4usize];
    ["Alignment of CONTROL_Type"][::core::mem::align_of::<CONTROL_Type>() - 4usize];
    ["Offset of field: CONTROL_Type::b"][::core::mem::offset_of!(CONTROL_Type, b) - 0usize];
    ["Offset of field: CONTROL_Type::w"][::core::mem::offset_of!(CONTROL_Type, w) - 0usize];
};
#[doc = "\\brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVIC_Type {
    #[doc = "< Offset: 0x000 (R/W)  Interrupt Set Enable Register"]
    pub ISER: [u32; 1usize],
    pub RESERVED0: [u32; 31usize],
    #[doc = "< Offset: 0x080 (R/W)  Interrupt Clear Enable Register"]
    pub ICER: [u32; 1usize],
    pub RSERVED1: [u32; 31usize],
    #[doc = "< Offset: 0x100 (R/W)  Interrupt Set Pending Register"]
    pub ISPR: [u32; 1usize],
    pub RESERVED2: [u32; 31usize],
    #[doc = "< Offset: 0x180 (R/W)  Interrupt Clear Pending Register"]
    pub ICPR: [u32; 1usize],
    pub RESERVED3: [u32; 31usize],
    pub RESERVED4: [u32; 64usize],
    #[doc = "< Offset: 0x300 (R/W)  Interrupt Priority Register"]
    pub IP: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NVIC_Type"][::core::mem::size_of::<NVIC_Type>() - 800usize];
    ["Alignment of NVIC_Type"][::core::mem::align_of::<NVIC_Type>() - 4usize];
    ["Offset of field: NVIC_Type::ISER"][::core::mem::offset_of!(NVIC_Type, ISER) - 0usize];
    ["Offset of field: NVIC_Type::RESERVED0"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED0) - 4usize];
    ["Offset of field: NVIC_Type::ICER"][::core::mem::offset_of!(NVIC_Type, ICER) - 128usize];
    ["Offset of field: NVIC_Type::RSERVED1"]
        [::core::mem::offset_of!(NVIC_Type, RSERVED1) - 132usize];
    ["Offset of field: NVIC_Type::ISPR"][::core::mem::offset_of!(NVIC_Type, ISPR) - 256usize];
    ["Offset of field: NVIC_Type::RESERVED2"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED2) - 260usize];
    ["Offset of field: NVIC_Type::ICPR"][::core::mem::offset_of!(NVIC_Type, ICPR) - 384usize];
    ["Offset of field: NVIC_Type::RESERVED3"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED3) - 388usize];
    ["Offset of field: NVIC_Type::RESERVED4"]
        [::core::mem::offset_of!(NVIC_Type, RESERVED4) - 512usize];
    ["Offset of field: NVIC_Type::IP"][::core::mem::offset_of!(NVIC_Type, IP) - 768usize];
};
#[doc = "\\brief  Structure type to access the System Control Block (SCB)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCB_Type {
    #[doc = "< Offset: 0x000 (R/ )  CPUID Base Register"]
    pub CPUID: u32,
    #[doc = "< Offset: 0x004 (R/W)  Interrupt Control and State Register"]
    pub ICSR: u32,
    pub RESERVED0: u32,
    #[doc = "< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register"]
    pub AIRCR: u32,
    #[doc = "< Offset: 0x010 (R/W)  System Control Register"]
    pub SCR: u32,
    #[doc = "< Offset: 0x014 (R/W)  Configuration Control Register"]
    pub CCR: u32,
    pub RESERVED1: u32,
    #[doc = "< Offset: 0x01C (R/W)  System Handlers Priority Registers. [0] is RESERVED"]
    pub SHP: [u32; 2usize],
    #[doc = "< Offset: 0x024 (R/W)  System Handler Control and State Register"]
    pub SHCSR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCB_Type"][::core::mem::size_of::<SCB_Type>() - 40usize];
    ["Alignment of SCB_Type"][::core::mem::align_of::<SCB_Type>() - 4usize];
    ["Offset of field: SCB_Type::CPUID"][::core::mem::offset_of!(SCB_Type, CPUID) - 0usize];
    ["Offset of field: SCB_Type::ICSR"][::core::mem::offset_of!(SCB_Type, ICSR) - 4usize];
    ["Offset of field: SCB_Type::RESERVED0"][::core::mem::offset_of!(SCB_Type, RESERVED0) - 8usize];
    ["Offset of field: SCB_Type::AIRCR"][::core::mem::offset_of!(SCB_Type, AIRCR) - 12usize];
    ["Offset of field: SCB_Type::SCR"][::core::mem::offset_of!(SCB_Type, SCR) - 16usize];
    ["Offset of field: SCB_Type::CCR"][::core::mem::offset_of!(SCB_Type, CCR) - 20usize];
    ["Offset of field: SCB_Type::RESERVED1"]
        [::core::mem::offset_of!(SCB_Type, RESERVED1) - 24usize];
    ["Offset of field: SCB_Type::SHP"][::core::mem::offset_of!(SCB_Type, SHP) - 28usize];
    ["Offset of field: SCB_Type::SHCSR"][::core::mem::offset_of!(SCB_Type, SHCSR) - 36usize];
};
#[doc = "\\brief  Structure type to access the System Timer (SysTick)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SysTick_Type {
    #[doc = "< Offset: 0x000 (R/W)  SysTick Control and Status Register"]
    pub CTRL: u32,
    #[doc = "< Offset: 0x004 (R/W)  SysTick Reload Value Register"]
    pub LOAD: u32,
    #[doc = "< Offset: 0x008 (R/W)  SysTick Current Value Register"]
    pub VAL: u32,
    #[doc = "< Offset: 0x00C (R/ )  SysTick Calibration Register"]
    pub CALIB: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SysTick_Type"][::core::mem::size_of::<SysTick_Type>() - 16usize];
    ["Alignment of SysTick_Type"][::core::mem::align_of::<SysTick_Type>() - 4usize];
    ["Offset of field: SysTick_Type::CTRL"][::core::mem::offset_of!(SysTick_Type, CTRL) - 0usize];
    ["Offset of field: SysTick_Type::LOAD"][::core::mem::offset_of!(SysTick_Type, LOAD) - 4usize];
    ["Offset of field: SysTick_Type::VAL"][::core::mem::offset_of!(SysTick_Type, VAL) - 8usize];
    ["Offset of field: SysTick_Type::CALIB"]
        [::core::mem::offset_of!(SysTick_Type, CALIB) - 12usize];
};
unsafe extern "C" {
    #[doc = " \\addtogroup group_flash\n\n\\brief Flash memory in PSoC devices provides nonvolatile storage for user\nfirmware, user configuration data, and bulk data storage. See the device\ndatasheet and TRM for more information on Flash architecture.\n\n\\section section_flash_protection Flash Protection\nPSoC devices include a flexible flash-protection model that prevents access\nand visibility to on-chip flash memory. The device offers the ability to\nassign one of two protection levels to each row of flash: unprotected and\nfull protection. The required protection level can be selected using the Flash\nSecurity tab of the PSoC Creator DWR file. Flash protection levels can only be\nchanged by performing a complete flash erase. The Flash programming APIs will\nfail to write a row with Full Protection level. For more information on\nprotection model, refer to the Flash Security Editor section in the PSoC\nCreator Help.\n\n\\section section_flash_working_with Working with Flash\nFlash programming operations are implemented as system calls. System calls are\nexecuted out of SROM in the privileged mode of operation. Users have no access\nto read or modify the SROM code. The CPU requests the system call by writing\nthe function opcode and parameters to the System Performance Controller (SPC)\ninput registers, and then requesting the SROM to execute the function. Based\non the function opcode, the SPC executes the corresponding system call from\nSROM and updates the SPC status register. The CPU should read this status\nregister for the pass/fail result of the function execution. As part of\nfunction execution, the code in SROM interacts with the SPC interface to do\nthe actual flash programming operations.\n\nIt can take as many as 20 milliseconds to write to flash. During this time,\nthe device should not be reset, or unexpected changes may be made to portions\nof the flash. Reset sources include XRES pin, software reset, and watchdog.\nMake sure that these are not inadvertently activated. Also, the low voltage\ndetect circuits should be configured to generate an interrupt instead of a\nreset.\n\nThe flash can be read either by the cache controller or the SPC. Flash write\ncan be performed only by the SPC. Both the SPC and cache cannot simultaneously\naccess flash memory. If the cache controller tries to access flash at the same\ntime as the SPC, then it must wait until the SPC completes its flash access\noperation. The CPU, which accesses the flash memory through the cache\ncontroller, is therefore also stalled in this circumstance. If a CPU code\nfetch has to be done from flash memory due to a cache miss condition, then the\ncache would have to wait until the SPC completes the flash write operation.\nThus the CPU code execution will also be halted till the flash write is\ncomplete. Flash is directly mapped into memory space and can be read directly.\n\n\\note Flash write operations on PSoC 4000 devices modify the clock settings of\nthe device during the period of the write operation.\nRefer to the \\ref CySysFlashWriteRow() API documentation for details.\n\n @{"]
    pub fn CySysFlashWriteRow(rowNum: uint32, rowData: *const uint8) -> uint32;
}
unsafe extern "C" {
    pub fn CySysFlashSetWaitCycles(freq: uint32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cySysFlashClockBackupStruct {
    pub imoConfigReg: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cySysFlashClockBackupStruct"]
        [::core::mem::size_of::<cySysFlashClockBackupStruct>() - 4usize];
    ["Alignment of cySysFlashClockBackupStruct"]
        [::core::mem::align_of::<cySysFlashClockBackupStruct>() - 4usize];
    ["Offset of field: cySysFlashClockBackupStruct::imoConfigReg"]
        [::core::mem::offset_of!(cySysFlashClockBackupStruct, imoConfigReg) - 0usize];
};
pub type CY_SYS_FLASH_CLOCK_BACKUP_STRUCT = cySysFlashClockBackupStruct;
unsafe extern "C" {
    #[doc = " \\addtogroup group_power_management Power Management API\n @{\n\n\\brief PSoC 4 devices support the following power modes (in order of high to low power consumption): Active, Sleep,\nDeep Sleep, Hibernate, and Stop. Active, Sleep and Deep-Sleep are standard ARM defined power modes, supported by the\nARM CPUs. Hibernate/Stop are even lower power modes that are entered from firmware just like Deep-Sleep, but on wakeup\nthe CPU (and all peripherals) goes through a full reset.\n\nThere is a full range of power modes supported by PSoC devices to control power consumption and the amount of available\nresources. See the following table for the supported power modes.\n\nMode        | PSoC 4000              | Rest Devices           |\n----------- | ---------------------- | ---------------------- |\nActive      |          Y             |       Y                |\nSleep       |          Y             |       Y                |\nDeep Sleep  |          Y             |       Y                |\nHibernate   |          Y             |       Y                |\nStop        |                        |       Y                |\n\nFor the ARM-based devices (PSoC 4), an interrupt is required for the CPU to wake up. The Power Management implementation\nassumes that wakeup time is configured with a separate component (component-based wakeup time configuration) for an\ninterrupt to be issued on terminal count.\n\nAll pending interrupts should be cleared before the device is put into low power mode, even if they are masked.\n\nThe Power Management API is provided in the CyPm.c and CyPm.h files.\n\n\n\\section group_power_management_implementation Implementation\nFor PSoC 4100, PSoC 4000U and PSoC 4200 devices, the software should set EXT_VCCD bit in the PWR_CONTROL register when\nVccd is shorted to Vddd on the board. This impacts the chip internal state transitions where it is necessary to know\nwhether Vccd is connected or floating to achieve minimum current in low power modes. Note Setting this bit turns off\nthe active regulator and will lead to a system reset unless both Vddd and Vccd pins are supplied externally. Refer to\nthe device TRM for more information.\n\nIt is safe to call PM APIs from the ISR. The wakeup conditions for Sleep and DeepSleep low power modes are illustrated\nin the following table.\n\nInterrupts State  |  Condition                      | Wakeup    |   ISR Execution   |\n------------------|---------------------------------|-----------|------------------ |\nUnmasked          | IRQ priority > current level    | Yes       |   Yes             |\nUnmasked          | IRQ priority  current level    | No        |   No              |\nMasked            | IRQ priority > current level    | Yes       |   No              |\nMasked            | IRQ priority  current level    | No        |   No              |\n\n\n\\section group_power_management_clocks Clock Configuration\nFor PSoC 4100 BLE and PSoC 4200 BLE devices, the HFCLK source should be set to IMO before switching the device into low\npower mode. The IMO should be enabled (by calling CySysClkImoStart(), if it is not) and HFCLK source should be changed\nto IMO by calling CySysClkWriteHfclkDirect(CY_SYS_CLK_HFCLK_IMO).\n\nIf the System clock frequency is increased by switching to the IMO, the CySysFlashSetWaitCycles() function with an\nappropriate parameter should be called beforehand. Also, it can optionally be called after lowering the System clock\nfrequency in order to improve CPU performance. See CySysFlashSetWaitCycles() description for the details.\n\n\n\n"]
    pub fn CySysPmSleep();
}
unsafe extern "C" {
    pub fn CySysPmDeepSleep();
}
unsafe extern "C" {
    pub fn CySysPmHibernate();
}
unsafe extern "C" {
    pub fn CySysPmFreezeIo();
}
unsafe extern "C" {
    pub fn CySysPmUnfreezeIo();
}
unsafe extern "C" {
    pub fn CySysPmGetResetReason() -> uint32;
}
unsafe extern "C" {
    pub fn CySysPmStop();
}
unsafe extern "C" {
    pub fn CySysPmSetWakeupPolarity(polarity: uint32);
}
#[doc = " EEPROM configuration structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_stc_eeprom_config_t {
    #[doc = " The number of bytes to store in EEPROM"]
    pub eepromSize: uint32,
    #[doc = " The amount of wear leveling from 1 to 10. 1 means no wear leveling\n is used."]
    pub wearLevelingFactor: uint32,
    #[doc = " If not zero, a redundant copy of the Em_EEPROM is included."]
    pub redundantCopy: uint8,
    #[doc = " If not zero, a blocking write to flash is used. Otherwise non-blocking\n write is used. This parameter is used only for PSoC 6."]
    pub blockingWrite: uint8,
    #[doc = " The start address for the EEPROM memory in the user's flash."]
    pub userFlashStartAddr: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cy_stc_eeprom_config_t"][::core::mem::size_of::<cy_stc_eeprom_config_t>() - 16usize];
    ["Alignment of cy_stc_eeprom_config_t"]
        [::core::mem::align_of::<cy_stc_eeprom_config_t>() - 4usize];
    ["Offset of field: cy_stc_eeprom_config_t::eepromSize"]
        [::core::mem::offset_of!(cy_stc_eeprom_config_t, eepromSize) - 0usize];
    ["Offset of field: cy_stc_eeprom_config_t::wearLevelingFactor"]
        [::core::mem::offset_of!(cy_stc_eeprom_config_t, wearLevelingFactor) - 4usize];
    ["Offset of field: cy_stc_eeprom_config_t::redundantCopy"]
        [::core::mem::offset_of!(cy_stc_eeprom_config_t, redundantCopy) - 8usize];
    ["Offset of field: cy_stc_eeprom_config_t::blockingWrite"]
        [::core::mem::offset_of!(cy_stc_eeprom_config_t, blockingWrite) - 9usize];
    ["Offset of field: cy_stc_eeprom_config_t::userFlashStartAddr"]
        [::core::mem::offset_of!(cy_stc_eeprom_config_t, userFlashStartAddr) - 12usize];
};
#[doc = " The EEPROM context data structure. It is used to store the specific\n EEPROM context data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_stc_eeprom_context_t {
    #[doc = " The pointer to the end address of EEPROM including wear leveling overhead\n and excluding redundant copy overhead."]
    pub wlEndAddr: uint32,
    #[doc = " The number of flash rows allocated for the EEPROM excluding the number of\n rows allocated for wear leveling and redundant copy overhead."]
    pub numberOfRows: uint32,
    #[doc = " The address of the last written EEPROM row"]
    pub lastWrRowAddr: uint32,
    #[doc = " The number of bytes to store in EEPROM"]
    pub eepromSize: uint32,
    #[doc = " The amount of wear leveling from 1 to 10. 1 means no wear leveling\n is used."]
    pub wearLevelingFactor: uint32,
    #[doc = " If not zero, a redundant copy of the Em_EEPROM is included."]
    pub redundantCopy: uint8,
    #[doc = " If not zero, a blocking write to flash is used. Otherwise non-blocking\n write is used. This parameter is used only for PSoC 6."]
    pub blockingWrite: uint8,
    #[doc = " The start address for the EEPROM memory in the user's flash."]
    pub userFlashStartAddr: uint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cy_stc_eeprom_context_t"]
        [::core::mem::size_of::<cy_stc_eeprom_context_t>() - 28usize];
    ["Alignment of cy_stc_eeprom_context_t"]
        [::core::mem::align_of::<cy_stc_eeprom_context_t>() - 4usize];
    ["Offset of field: cy_stc_eeprom_context_t::wlEndAddr"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, wlEndAddr) - 0usize];
    ["Offset of field: cy_stc_eeprom_context_t::numberOfRows"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, numberOfRows) - 4usize];
    ["Offset of field: cy_stc_eeprom_context_t::lastWrRowAddr"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, lastWrRowAddr) - 8usize];
    ["Offset of field: cy_stc_eeprom_context_t::eepromSize"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, eepromSize) - 12usize];
    ["Offset of field: cy_stc_eeprom_context_t::wearLevelingFactor"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, wearLevelingFactor) - 16usize];
    ["Offset of field: cy_stc_eeprom_context_t::redundantCopy"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, redundantCopy) - 20usize];
    ["Offset of field: cy_stc_eeprom_context_t::blockingWrite"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, blockingWrite) - 21usize];
    ["Offset of field: cy_stc_eeprom_context_t::userFlashStartAddr"]
        [::core::mem::offset_of!(cy_stc_eeprom_context_t, userFlashStartAddr) - 24usize];
};
#[doc = "< The function executed successfully"]
pub const cy_en_em_eeprom_status_t_CY_EM_EEPROM_SUCCESS: cy_en_em_eeprom_status_t = 0;
#[doc = "< The input parameter is invalid"]
pub const cy_en_em_eeprom_status_t_CY_EM_EEPROM_BAD_PARAM: cy_en_em_eeprom_status_t = 1;
#[doc = "< The data in EEPROM is corrupted"]
pub const cy_en_em_eeprom_status_t_CY_EM_EEPROM_BAD_CHECKSUM: cy_en_em_eeprom_status_t = 2;
#[doc = "< Failed to place the EEPROM in flash"]
pub const cy_en_em_eeprom_status_t_CY_EM_EEPROM_BAD_DATA: cy_en_em_eeprom_status_t = 3;
#[doc = "< Write to EEPROM failed"]
pub const cy_en_em_eeprom_status_t_CY_EM_EEPROM_WRITE_FAIL: cy_en_em_eeprom_status_t = 4;
#[doc = " EEPROM return enumeration type"]
pub type cy_en_em_eeprom_status_t = cty::c_uint;
unsafe extern "C" {
    #[doc = " \\addtogroup group_em_eeprom_functions\n \\{"]
